jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/**
  ******************************************************************************
  * @file    stm32w108xx.h
  * @author  MCD Application Team
  * @version V1.0.1
  * @date    30-November-2012
  * @brief   CMSIS Cortex-M3 Device Peripheral Access Layer Header File.  
  *          This file contains all the peripheral register's definitions, bits 
  *          definitions and memory mapping for STM32W108xx devices.
  *
  *          The file is the unique include file that the application programmer
  *          is using in the C source code, usually in main.c. This file contains:
  *           - Configuration section that allows to select:
  *              - The device used in the target application
  *              - To use or not the peripheral’s drivers in application code(i.e. 
  *                code will be based on direct access to peripheral’s registers 
  *                rather than drivers API), this option is controlled by 
  *                "#define USE_STDPERIPH_DRIVER"
  *              - To change few application-specific parameters such as the HSE 
  *                crystal frequency
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral’s registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32w108xx
  * @{
  */

#ifndef __STM32W108XX_H
#define __STM32W108XX_H

#ifdef __cplusplus
 extern "C" {
#endif

/** @addtogroup Library_configuration_section
  * @{
  */
  
/** Uncomment the line below according to the target STM32 device used in your
  * application 
  */

#if !defined (STM32W108C8) && !defined (STM32W108CB) && !defined (STM32W108CC) && !defined (STM32W108CZ) && !defined (STM32W108HB)  
  /* #define STM32W108C8 */     /*!< STM32W108C8: 64k FLASH */
  /* #define STM32W108CB */     /*!< STM32W108CB: 128k FLASH */  
  /* #define STM32W108CC */     /*!< STM32W108CC: 256k FLASH */
  /* #define STM32W108CZ */     /*!< STM32W108CZ: 192k FLASH */  
  /* #define STM32W108HB */     /*!< STM32W108HB: 128k FLASH */
#endif

/**  Tip: To avoid modifying this file each time you need to switch between these
  *       devices, you can define the device in your toolchain compiler preprocessor.
  */

#if !defined (STM32W108C8) && !defined (STM32W108CB) && !defined (STM32W108CC) && !defined (STM32W108CZ) && !defined (STM32W108HB)  
 #error "Please select first the target STM32W108XX device used in your application (in stm32w108xx.h file)"
#endif

#if !defined  (USE_STDPERIPH_DRIVER)
/**
  * @brief Comment the line below if you will not use the peripherals drivers.
  * In this case, these drivers will not be included and the application code will 
  * be based on direct access to peripherals registers 
  */
  
  /* #define USE_STDPERIPH_DRIVER */
#endif /* USE_STDPERIPH_DRIVER */

/**
  * @brief In the following line adjust the value of External High Speed oscillator (HSE)
  * used in your application 
  * 
  * Tip: To avoid modifying this file each time you need to use different HSE, you
  *     can define the HSE value in your toolchain compiler preprocessor.
  */           
#if !defined  (HSE_VALUE) 
  #define HSE_VALUE    ((uint32_t)24000000) /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

/**
  * @brief In the following line adjust the External High Speed oscillator (HSE) Startup 
  * Timeout value 
  */
#if !defined  (HSE_STARTUP_TIMEOUT) 
  #define HSE_STARTUP_TIMEOUT    ((uint16_t)0x0500)   /*!< Time out for HSE start up */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief The internal high speed clock (HSI) should be calibrated before using it. 
  *        The defined one is the theoretical value. 
  */
#if !defined  (HSI_VALUE)   
  #define HSI_VALUE    ((uint32_t)12000000) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/**
  * @brief The internal low speed clock (LSI) should be calibrated before using it. 
  *        The defined one is the theoretical value. 
  */
#if !defined  (LSI_VALUE) 
#define LSI_VALUE  ((uint32_t)10000)    /*!< Value of the Internal Low Speed oscillator in Hz
                                             The real value may vary depending on the variations
                                             in voltage and temperature.  */
#endif

/**
  * @brief The following line define the External low Speed oscillator (LSE).
  *        
  */
#if !defined  (LSE_VALUE) 
#define LSE_VALUE  ((uint32_t)32768)    /*!< Value of the External Low Speed oscillator in Hz */
#endif

/**
  * @brief STM32W108XX Standard Peripherals Library version number V0.0.1RC1
  */
#define __STM32W108XX_STDPERIPH_VERSION_MAIN   (0x00) /*!< [31:24] main version */
#define __STM32W108XX_STDPERIPH_VERSION_SUB1   (0x00) /*!< [23:16] sub1 version */
#define __STM32W108XX_STDPERIPH_VERSION_SUB2   (0x01) /*!< [15:8]  sub2 version */
#define __STM32W108XX_STDPERIPH_VERSION_RC     (0x01) /*!< [7:0]  release candidate */ 
#define __STM32W108XX_STDPERIPH_VERSION        ((__STM32W108XX_STDPERIPH_VERSION_MAIN << 24)\
                                               |(__STM32W108XX_STDPERIPH_VERSION_SUB1 << 16)\
                                               |(__STM32W108XX_STDPERIPH_VERSION_SUB2 << 8)\
                                               |(__STM32W108XX_STDPERIPH_VERSION_RC))
/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
 * @brief Configuration of the Cortex-M3 Processor and Core Peripherals 
 */
#define __CM3_REV                 0x0101  /*!< Core revision r1p1                              */
#define __MPU_PRESENT             1       /*!< STM32W108XX  provides an MPU                    */
#define __NVIC_PRIO_BITS          4       /*!< STM32W108XX uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used    */
#define __FPU_PRESENT             0       /*!< FPU is not present                              */

/**
  * @brief STM32W108XX Interrupt Number Definition, according to the selected device 
  *        in @ref Library_configuration_section 
  */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ****************************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                          */
  MemoryManagement_IRQn       = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt                           */
  BusFault_IRQn               = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                                   */
  UsageFault_IRQn             = -10,    /*!< 6 Cortex-M3 Usage Fault Interrupt                                 */
  SVCall_IRQn                 = -5,     /*!< 11 Cortex-M3 SV Call Interrupt                                    */
  DebugMonitor_IRQn           = -4,     /*!< 12 Cortex-M3 Debug Monitor Interrupt                              */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M3 Pend SV Interrupt                                    */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M3 System Tick Interrupt                                */
/******  STM32W108xx specific Interrupt Numbers ****************************************************************/
  TIM1_IRQn                   = 0,      /*!< Timer 1 Interrupt                                                 */
  TIM2_IRQn                   = 1,      /*!< Timer 1 Interrupt                                                 */
  MNG_IRQn                    = 2,      /*!< Management Peripheral Interrupt                                   */
  BASEBAND_IRQn               = 3,      /*!< Base Band Interrupt                                               */
  SLPTIM_IRQn                 = 4,      /*!< Sleep Timer Interrupt                                             */
  SC1_IRQn                    = 5,      /*!< Serial Controller 1 Interrupt                                     */
  SC2_IRQn                    = 6,      /*!< Serial Controller 2 Interrupt                                     */
  SECURITY_IRQn               = 7,      /*!< Security Interrupt                                                */
  MAC_TIM_IRQn                = 8,      /*!< MAC Timer Interrupt                                               */
  MAC_TR_IRQn                 = 9,      /*!< MAC Transmit Interrupt                                            */
  MAC_RE_IRQn                 = 10,     /*!< MAC Receive Interrupt                                             */
  ADC_IRQn                    = 11,     /*!< ADC Interrupt                                                     */
  EXTIA_IRQn                  = 12,     /*!< EXTI port A interrupt                                             */
  EXTIB_IRQn                  = 13,     /*!< EXTI port B interrupt                                             */
  EXTIC_IRQn                  = 14,     /*!< EXTI port C interrupt                                             */
  EXTID_IRQn                  = 15,     /*!< EXTI port D interrupt                                             */    
  DEBUG_IRQn                  = 16      /*!< Debug Interrupt                                                   */
} IRQn_Type;

/**
  * @}
  */

#include "core_cm3.h"             /* Cortex-M3 processor and core peripherals */
#include "system_stm32w108xx.h"
#include <stdint.h>

