jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/** @addtogroup Exported_types
  * @{
  */
  

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;      

/**
  * @}
  */

/** @addtogroup Peripheral_registers_structures
  * @{
  */

/** 
  * @brief Clock Controller Registers 
  */ 
typedef struct
{ 
  __IO uint32_t SLEEPCR;          /*!< Sleep timer control register,            Address offset: 0x0008 */
  __IO uint32_t LSI10KCR;         /*!< LSI Clock (10KHz) control register,      Address offset: 0x000C */
  __IO uint32_t LSI1KCR;          /*!< LSI Clock (1KHz) control register,       Address offset: 0x0010 */
       uint32_t RESERVED0[4092];  /*!< Reserved */
  __IO uint32_t HSECR1;           /*!< HSE Clock (24MHz) control register 1,    Address offset: 0x4004 */
  __IO uint32_t HSICR;            /*!< HSI Clock (12MHz) trim register,         Address offset: 0x4008 */
  __IO uint32_t HSECOMPR;         /*!< HSE comparator Output,                   Address offset: 0x400C */
  __IO uint32_t PERIODCR;         /*!< Clock period control register,           Address offset: 0x4010 */
  __IO uint32_t PERIODSR;         /*!< Clock period status register,            Address offset: 0x4014 */
  __IO uint32_t DITHERCR;         /*!< Clock dither control register,           Address offset: 0x4018 */
  __IO uint32_t HSECR2;           /*!< HSE Clock (24MHz) control register 2,    Address offset: 0x401C */
  __IO uint32_t CPUCR;            /*!< Clock source select register,            Address offset: 0x4020 */
} CLK_TypeDef;

/** 
  * @brief Power Management Registers (PWR)
  */ 
typedef struct
{
  __IO uint32_t DSLEEPCR1;        /*!< Deep Sleep Control register 1            Address offset 0x0004 */
       uint32_t RESERVED0[3];     /*!< Reserved */
  __IO uint32_t DSLEEPCR2;        /*!< Deep Sleep Control register 2            Address offset 0x0014 */
  __IO uint32_t VREGCR;           /*!< Voltage regulator Control register 1     Address offset 0x0018 */
       uint32_t RESERVED1;        /*!< Reserved */
  __IO uint32_t WAKECR1;          /*!< Wake Control register 1                  Address offset 0x0020 */
  __IO uint32_t WAKECR2;          /*!< Wake Control register 2                  Address offset 0x0024 */
  __IO uint32_t WAKESR;           /*!< Wake Status register                     Address offset 0x0028 */
       uint32_t RESERVED2[2];     /*!< Reserved */
  __IO uint32_t CPWRUPREQSR;      /*!< CPWRUPREQ status register                Address offset 0x0034 */
  __IO uint32_t CSYSPWRUPREQSR;   /*!< CSYSPWRUPREQ status register             Address offset 0x0038 */
  __IO uint32_t CSYSPWRUPACKSR;   /*!< CSYSPWRUPACK status register             Address offset 0x003C */
  __IO uint32_t CSYSPWRUPACKCR;   /*!< CSYSPWRUPACK control register            Address offset 0x0040 */
       uint32_t RESERVED3[12017]; /*!< Reserved */
  __IO uint32_t WAKEPAR;          /*!< Wake GPIO Port A register                Address offset 0xBC08 */
  __IO uint32_t WAKEPBR;          /*!< Wake GPIO Port B register                Address offset 0xBC0C */
  __IO uint32_t WAKEPCR;          /*!< Wake GPIO Port C register                Address offset 0xBC10 */
       uint32_t RESERVED4[2];     /*!< Reserved */
  __IO uint32_t WAKEFILTR;        /*!< Wake filter register                     Address offset 0xBC1C */
} PWR_TypeDef; 
         
/** 
  * @brief Reset Registers 
  */
typedef struct
{
  __IO uint32_t SR;               /*!< Reset Status Register                    Address offset: 0x002C */
} RST_TypeDef;

/** 
  * @brief FLASH Registers
  */
typedef struct
{
  __IO uint32_t CLKER; 	          /*!< FLASH controller clock enable register   Address offset: 0x402C */
  __IO uint32_t CLKSR;	          /*!< FLASH controller clock status register   Address offset: 0x4030 */
       uint32_t RESERVED0[4083];  /*!< Reserved */
  __IO uint32_t ACR;              /*!< FLASH access control register,           Address offset: 0x8000 */
  __IO uint32_t KEYR;             /*!< FLASH key register,                      Address offset: 0x8004 */
  __IO uint32_t OPTKEYR;          /*!< FLASH OPT key register,                  Address offset: 0x8008 */
  __IO uint32_t SR;               /*!< FLASH status register,                   Address offset: 0x800C */
  __IO uint32_t CR;               /*!< FLASH control register,                  Address offset: 0x8010 */
  __IO uint32_t AR;               /*!< FLASH address register,                  Address offset: 0x8014 */
       uint32_t RESERVED1;        /*!< Reserved */
  __IO uint32_t OBR;              /*!< FLASH option bytes register,             Address offset: 0x801C */
  __IO uint32_t WRPR;             /*!< FLASH option bytes register,             Address offset: 0x8020 */
} FLASH_TypeDef;

/** 
  * @brief Memory Registers
  */
typedef struct
{
  __IO uint32_t RAMPROTR1;        /*!< Memory protection register1,             Address offset: 0x5000 */
  __IO uint32_t RAMPROTR2;        /*!< Memory protection register2,             Address offset: 0x5004 */
  __IO uint32_t RAMPROTR3;        /*!< Memory protection register3,             Address offset: 0x5008 */
  __IO uint32_t RAMPROTR4;        /*!< Memory protection register4,             Address offset: 0x500C */
  __IO uint32_t RAMPROTR5;        /*!< Memory protection register5,             Address offset: 0x5010 */
  __IO uint32_t RAMPROTR6;        /*!< Memory protection register6,             Address offset: 0x5014 */
  __IO uint32_t RAMPROTR7;        /*!< Memory protection register7,             Address offset: 0x5018 */
  __IO uint32_t RAMPROTR8;        /*!< Memory protection register8,             Address offset: 0x501C */
  __IO uint32_t DMAPROTR1;        /*!< DMA protection register1,                Address offset: 0x5020 */
  __IO uint32_t DMAPROTR2;        /*!< DMA protection register2,                Address offset: 0x5024 */
  __IO uint32_t RAMCR;            /*!< Memory configuration register,           Address offset: 0x5028 */
} MEM_TypeDef;

/** 
  * @brief Option Bytes Registers
  */
typedef struct
{
  __IO uint16_t RDP;              /*!< FLASH option byte Read protection,       Address 0x00 */
  __IO uint16_t Rsvd0;            /*!< Reserved */
  __IO uint16_t Rsvd1;            /*!< Reserved */
  __IO uint16_t Rsvd2;            /*!< Reserved */
  __IO uint16_t WRP0;             /*!< FLASH option byte write protection 0,    Address offset: 0x08 */
  __IO uint16_t WRP1;             /*!< FLASH option byte write protection 1,    Address offset: 0x0A */
  __IO uint16_t WRP2;             /*!< FLASH option byte write protection 2,    Address offset: 0x0C */
  __IO uint16_t WRP3;             /*!< FLASH option byte write protection 0,    Address offset: 0x0E */
} OB_TypeDef;

/** 
  * @brief GPIO Registers
  */
typedef struct
{
  __IO uint32_t CRL;              /*!< GPIO port configuration low register,    Address offset: 0x00 */
  __IO uint32_t CRH;              /*!< GPIO port configuration high register,   Address offset: 0x04 */
  __IO uint32_t IDR;              /*!< GPIO port input data register,           Address offset: 0x08 */
  __IO uint32_t ODR;              /*!< GPIO port output data register,          Address offset: 0x0C */
  __IO uint32_t BSR;              /*!< GPIO port bit set registerBSR,           Address offset: 0x10 */
  __IO uint32_t BRR;              /*!< GPIO port bit reset registerBRR,         Address offset: 0x14 */
} GPIO_TypeDef;
  
/** 
  * @brief GPIO Debug Registers
  */
typedef struct
{
  __IO uint32_t PCTRACECR;        /*!< Clock PC trace register,                 Address offset 0x4028 */
       uint32_t RESERVED[7925];
  __IO uint32_t DBGCR;            /*!< GPIO debug configuration register,       Address offset 0xBC00 */
  __IO uint32_t DBGSR;            /*!< GPIO debug status register,              Address offset 0xBC04 */
} GPIO_DBG_TypeDef;

/** 
  * @brief Management interrupt Registers
  */
typedef struct
{
  __IO uint32_t ISR;            /*!< Management Interrupt status Register,      Address offset 0xA018 */
       uint32_t RESERVED0[15];  /*!< Reserved */
  __IO uint32_t IER;            /*!< Management Interrupt Enable Register,      Address offset 0xA058 */
} MGMT_IT_TypeDef;

/** 
  * @brief EXTI Registers
  */

typedef struct
{  
  __IO uint32_t PR;               /*!< EXTI pending register,                   Address offset 0xA814 */
       uint32_t RESERVED0[18];    /*!< Reserved */
  __IO uint32_t TSR[4];           /*!< EXTI trigger source register,            Address offset 0xA860 */
       uint32_t RESERVED1[1257];  /*!< Reserved */
  __IO uint32_t CR[2];            /*!< EXTI configuration register,             Address offset 0xBC14 */
} EXTI_TypeDef;

/** 
  * @brief WDG Registers
  */

typedef struct
{
  __IO uint32_t CR;               /*!< WDG configuration register,      	      Address offset 0x6000 */
  __IO uint32_t KR;               /*!< WDG key register,      	                Address offset 0x6004 */
  __IO uint32_t KICKSR;           /*!< WDG kick-start register,      	          Address offset 0x6008 */
} WDG_TypeDef;

/** 
  * @brief Sleep Timer Registers
  */
typedef struct 
{
  __IO uint32_t CR;               /*!< SLPTMR configuration register,           Address offset 0x600C */
  __IO uint32_t CNTH;             /*!< SLPTMR counter high register,            Address offset 0x6010 */
  __IO uint32_t CNTL;             /*!< SLPTMR counter high register,            Address offset 0x6014 */
  __IO uint32_t CMPAH;            /*!< SLPTMR compare A high register,          Address offset 0x6018 */
  __IO uint32_t CMPAL;            /*!< SLPTMR compare A low register,           Address offset 0x601C */
  __IO uint32_t CMPBH;            /*!< SLPTMR compare B high register,          Address offset 0x6020 */
  __IO uint32_t CMPBL;            /*!< SLPTMR compare B low register,           Address offset 0x6024 */
       uint32_t RESERVED0[4091];  /*!< Reserved */
  __IO uint32_t ISR;              /*!< SLPTMR interrupt status register,        Address offset 0xA014 */
       uint32_t RESERVED1[2];     /*!< Reserved */
  __IO uint32_t IFR;              /*!< SLPTMR force interrupts register,        Address offset 0xA020 */
       uint32_t RESERVED2[12];    /*!< Reserved */
  __IO uint32_t IER;              /*!< SLPTMR interrupt enable register,        Address offset 0xA054 */
} SLPTMR_TypeDef;

/** 
  * @brief MAC Timer Registers
  */
typedef struct 
{
  __IO uint32_t CNTR;            /*!< MACTMR counter register,                  Address offset 0x2038 */
       uint32_t RESERVED[20];    /*!< Reserved */
  __IO uint32_t CR;              /*!< MACTMR configuration register,            Address offset 0x208C */
} MACTMR_TypeDef;

/** 
  * @brief  Analog to Digital Converter (ADC) Registers
  */ 
typedef struct
{  
  __IO uint32_t ISR;              /*!< ADC Interrupt Status Register,           Address offset: 0xA810 */
       uint32_t RESERVED0[15];    /*!< Reserved */
  __IO uint32_t IER;              /*!< ADC Interrupt Enable Register,           Address offset: 0xA850 */
       uint32_t RESERVED1[2540];  /*!< Reserved.*/
  __IO uint32_t CR;               /*!< ADC Configuration Register,              Address offset: 0xD004 */
  __IO uint32_t OFFSETR;          /*!< ADC Offset Register,                     Address offset: 0xD008 */
  __IO uint32_t GAINR;            /*!< ADC Gain Register,                       Address offset: 0xD00C */
  __IO uint32_t DMACR;            /*!< ADC DMA Configuration Register,          Address offset: 0xD010 */
  __IO uint32_t DMASR;            /*!< ADC DMA Status Register,                 Address offset: 0xD014 */
  __IO uint32_t DMAMSAR;          /*!< ADC DMA Memory Start Address Register,   Address offset: 0xD018 */
  __IO uint32_t DMANDTR;          /*!< ADC DMA Number of Data Register,         Address offset: 0xD01C */
  __IO uint32_t DMAMNAR;          /*!< ADC DMA Memory Next Address Register,    Address offset: 0xD020 */
  __IO uint32_t DMACNDTR;         /*!< ADC DMA Channel Number of Data Register, Address offset: 0xD024 */
} ADC_TypeDef;

/** 
  * @brief Timer Registers
  */
typedef struct 
{
 __IO uint32_t CR1;               /*!< TIM control register 1,                  Address offset 0x00 */
 __IO uint32_t CR2;               /*!< TIM control register 2,                  Address offset 0x04 */
 __IO uint32_t SMCR;              /*!< TIM slave Mode Control register,         Address offset 0x08 */
      uint32_t RESERVED0[2];      /*!< Reserved */
 __IO uint32_t EGR;               /*!< TIM event generation register            Address offset 0x14 */
 __IO uint32_t CCMR1;             /*!< TIM capture/compare mode register 1,     Address offset 0x18 */
 __IO uint32_t CCMR2;             /*!< TIM capture/compare mode register 2,     Address offset 0x1C */
 __IO uint32_t CCER;              /*!< TIM capture/compare enable register,     Address offset 0x20 */
 __IO uint32_t CNT;               /*!< TIM counter register,                    Address offset 0x24 */
 __IO uint32_t PSC;               /*!< TIM prescaler register,                  Address offset 0x28 */
 __IO uint32_t ARR;               /*!< TIM auto-reload register,                Address offset 0x2C */
      uint32_t RESERVED1;         /*!< Reserved */
 __IO uint32_t CCR1;              /*!< TIM capture/compare register 1,          Address offset 0x34 */
 __IO uint32_t CCR2;              /*!< TIM capture/compare register 2,          Address offset 0x38 */
 __IO uint32_t CCR3;              /*!< TIM capture/compare register 3,          Address offset 0x3C */
 __IO uint32_t CCR4;              /*!< TIM capture/compare register 4,          Address offset 0x40 */
      uint32_t RESERVED2[3];      /*!< Reserved */
 __IO uint32_t OR;                /*!< TIM option register,                     Address offset 0x50 */
} TIM_TypeDef;

/** 
  * @brief Serial Controller Registers (Universal Asynchronous Receiver/Transmitter)
  */ 
typedef struct
{
  __IO uint32_t DR;               /*!< Serial control Data register             Address offset 0x00 */
       uint32_t RESERVED0[2];     /*!< Reserved */
  __IO uint32_t UARTSR;           /*!< UART control register                    Address offset 0x08 */
       uint32_t RESERVED1[2];     /*!< Reserved */
  __IO uint32_t CR;               /*!< Serial control control register          Address offset 0x14 */
       uint32_t RESERVED2[1];     /*!< Reserved */
  __IO uint32_t UARTCR;           /*!< UART control register                    Address offset 0x1C */
       uint32_t RESERVED3[2];     /*!< Reserved */
  __IO uint32_t UARTBRR1;         /*!< UART Baud rate register 1                Address offset 0x28 */
  __IO uint32_t UARTBRR2;         /*!< UART Baud rate register 2                Address offset 0x2C */
} SC_UART_TypeDef;

/** 
  * @brief Serial Controller Registers (Serial peripheral interface)
  */ 
typedef struct
{
  __IO uint32_t DR;               /*!< Serial control Data register             Address offset 0x00 */
  __IO uint32_t SPISR;            /*!< SPI status register                      Address offset 0x04 */ 
       uint32_t RESERVED0[4];     /*!< Reserved */
  __IO uint32_t CR;               /*!< Serial control control register          Address offset 0x18 */
  __IO uint32_t SPICR;            /*!< SPI status register                      Address offset 0x1C */ 
       uint32_t RESERVED1[1];     /*!< Reserved */
  __IO uint32_t CRR1;             /*!< Serial control clock rate register 1     Address offset 0x24 */
  __IO uint32_t CRR2;             /*!< Serial control clock rate register 2     Address offset 0x28 */
} SC_SPI_TypeDef;

/** 
  * @brief Serial Controller Registers (Inter-Integrated circuit)
  */ 
typedef struct
{
  __IO uint32_t DR;               /*!< Serial control Data register             Address offset 0x00 */
       uint32_t RESERVED0[1];     /*!< Reserved */
  __IO uint32_t I2CSR;            /*!< I2C status register                      Address offset 0x08 */
       uint32_t RESERVED1[1];     /*!< Reserved */
  __IO uint32_t I2CCR1;           /*!< I2C control register 1                   Address offset 0x10 */
  __IO uint32_t I2CCR2;           /*!< I2C control register 2                   Address offset 0x14 */
  __IO uint32_t CR;               /*!< Serial control control register          Address offset 0x18 */
       uint32_t RESERVED2[2];     /*!< Reserved */
  __IO uint32_t CRR1;             /*!< Serial control clock rate register 1     Address offset 0x24 */
  __IO uint32_t CRR2;             /*!< Serial control clock rate register 2     Address offset 0x28 */
} SC_I2C_TypeDef;

/** 
  * @brief Timer Interrupt Registers
  */
typedef struct 
{
  __IO uint32_t ISR;              /*!< TIM interrupt and status register        Address offset 0x00 */
       uint32_t RESERVED0[5];     /*!< Reserved */
  __IO uint32_t IMR;              /*!< TIM interrupt missed register            Address offset 0x18 */
       uint32_t RESERVED1[9];     /*!< Reserved */
  __IO uint32_t IER;              /*!< TIM interrupt enable register            Address offset 0x40 */
} TIM_IT_TypeDef;

/** 
  * @brief Serial Controller interrupt Registers
  */ 
typedef struct
{
  __IO uint32_t ISR;              /*!< Interrupt Status register                Address offset 0x08 */
       uint32_t RESERVED0[15];    /*!< Reserved */
  __IO uint32_t IER;              /*!< Interrupt Enable register                Address offset 0x48 */
       uint32_t RESERVED1[2];     /*!< Reserved */
  __IO uint32_t ICR;              /*!< Interrupt Control register               Address offset 0x54 */
} SC_IT_TypeDef;

/** 
  * @brief Serial Controller DMA Registers
  */ 
typedef struct
{
  __IO uint32_t DMARXCNTAR;       /*!< DMA Rx counter A register                Address offset 0x20 */
  __IO uint32_t DMARXCNTBR;       /*!< DMA Rx counter B register                Address offset 0x24 */
  __IO uint32_t DMATXCNTR;        /*!< DMA Tx counter register                  Address offset 0x28 */
  __IO uint32_t DMASR;            /*!< DMA status register                      Address offset 0x2C */ 
  __IO uint32_t DMACR;            /*!< DMA control register                     Address offset 0x30 */ 
  __IO uint32_t DMARXERRAR;       /*!< DMA Rx error A register                  Address offset 0x34 */
  __IO uint32_t DMARXERRBR;       /*!< DMA Rx error B register                  Address offset 0x38 */
       uint32_t RESERVED0[13];    /*!< Reserved */
  __IO uint32_t DMARXCNTSAVEDR;   /*!< DMA Rx Counter saved register            Address offset 0x70 */ 
} SC_DMA_TypeDef;

/** 
  * @brief Serial Controller DMA Channel Registers
  */
typedef struct
{
  __IO uint32_t DMABEGADDAR;      /*!< DMA begin address A register             Address offset 0x00 */
  __IO uint32_t DMAENDADDAR;      /*!< DMA end address A register               Address offset 0x04 */
  __IO uint32_t DMABEGADDBR;      /*!< DMA begin address B register             Address offset 0x08 */
  __IO uint32_t DMAENDADDBR;      /*!< DMA end address B register               Address offset 0x0C */
} SC_DMA_Channel_TypeDef;

/** @addtogroup Peripheral_memory_map
  * @{
  */
#define FLASH_BASE                  ((uint32_t)0x08000000)       /*!< FLASH base address in the alias region */
#define SRAM_BASE                   ((uint32_t)0x20000000)       /*!< SRAM base address in the alias region */ 
#define PERIPH_BASE                 ((uint32_t)0x40000000)       /*!< Peripheral base address in the alias region */

#define SRAM_BB_BASE                ((uint32_t)0x22000000)       /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE              ((uint32_t)0x42000000)       /*!< Peripheral base address in the bit-band region */

/*!< Peripheral memory map */
#define PWR_BASE                    (PERIPH_BASE + 0x0004)
#define CLK_BASE                    (PERIPH_BASE + 0x0008)
#define RST_BASE                    (PERIPH_BASE + 0x002C)
#define MACTMR_BASE                 (PERIPH_BASE + 0x2038)
#define GPIO_DBG_BASE               (PERIPH_BASE + 0x4028)
#define FLASH_R_BASE                (PERIPH_BASE + 0x402C)
#define MEM_R_BASE                  (PERIPH_BASE + 0x5000)
#define WDG_BASE                    (PERIPH_BASE + 0x6000)
#define SLPTMR_BASE                 (PERIPH_BASE + 0x600C)
#define ADC_BASE                    (PERIPH_BASE + 0xA810)
#define EXTI_BASE                   (PERIPH_BASE + 0xA814)
#define GPIOA_BASE                  (PERIPH_BASE + 0xB000)
#define GPIOB_BASE                  (PERIPH_BASE + 0xB400)
#define GPIOC_BASE                  (PERIPH_BASE + 0xB800)
#define SC1_UART_BASE               (PERIPH_BASE + 0xC83C)
#define SC1_SPI_BASE                (PERIPH_BASE + 0xC83C)
#define SC1_I2C_BASE                (PERIPH_BASE + 0xC83C)
#define SC2_UART_BASE               (PERIPH_BASE + 0xC03C)
#define SC2_SPI_BASE                (PERIPH_BASE + 0xC03C)
#define SC2_I2C_BASE                (PERIPH_BASE + 0xC03C)
#define TIM1_BASE                   (PERIPH_BASE + 0xE000)
#define TIM2_BASE                   (PERIPH_BASE + 0xF000)
#define OB_BASE                     ((uint32_t)0x08040800)       /*!< Flash Option Bytes base address */

#define MGMT_IT_BASE                (PERIPH_BASE + 0xA018)
#define TIM1_IT_BASE                (PERIPH_BASE + 0xA800)
#define TIM2_IT_BASE                (PERIPH_BASE + 0xA804)
#define SC1_IT_BASE                 (PERIPH_BASE + 0xA808)
#define SC2_IT_BASE                 (PERIPH_BASE + 0xA80C)

