jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
#define SC2_DMA_ChannelRx_BASE      (PERIPH_BASE + 0xC000)
#define SC2_DMA_ChannelTx_BASE      (PERIPH_BASE + 0xC010)
#define SC2_DMA_BASE                (PERIPH_BASE + 0xC020)

#define SC1_DMA_ChannelRx_BASE      (PERIPH_BASE + 0xC800)
#define SC1_DMA_ChannelTx_BASE      (PERIPH_BASE + 0xC810)
#define SC1_DMA_BASE                (PERIPH_BASE + 0xC820)

/** @addtogroup Peripheral_declaration
  * @{
  */  

#define PWR                         ((PWR_TypeDef *) PWR_BASE)
#define CLK                         ((CLK_TypeDef *) CLK_BASE)
#define RST                         ((RST_TypeDef *) RST_BASE)
#define MACTMR                      ((MACTMR_TypeDef *) MACTMR_BASE)
#define GPIO_DBG                    ((GPIO_DBG_TypeDef *) GPIO_DBG_BASE)
#define FLASH                       ((FLASH_TypeDef *) FLASH_R_BASE)
#define MEM                         ((MEM_TypeDef *) MEM_R_BASE)
#define WDG                         ((WDG_TypeDef *) WDG_BASE)
#define SLPTMR                      ((SLPTMR_TypeDef *) SLPTMR_BASE)
#define EXTI                        ((EXTI_TypeDef *) EXTI_BASE)
#define GPIOA                       ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                       ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                       ((GPIO_TypeDef *) GPIOC_BASE)
#define SC1_UART                    ((SC_UART_TypeDef *) SC1_UART_BASE)
#define SC1_SPI                     ((SC_SPI_TypeDef *) SC1_SPI_BASE)
#define SC1_I2C                     ((SC_I2C_TypeDef *) SC1_I2C_BASE)
#define SC2_UART                    ((SC_UART_TypeDef *) SC2_UART_BASE)
#define SC2_SPI                     ((SC_SPI_TypeDef *) SC2_SPI_BASE)
#define SC2_I2C                     ((SC_I2C_TypeDef *) SC2_I2C_BASE)
#define ADC                         ((ADC_TypeDef *) ADC_BASE) 
#define TIM1                        ((TIM_TypeDef *) TIM1_BASE)
#define TIM2                        ((TIM_TypeDef *) TIM2_BASE)
#define OB                          ((OB_TypeDef *) OB_BASE)
 
#define MGMT_IT                     ((MGMT_IT_TypeDef *) MGMT_IT_BASE)
#define TIM1_IT                     ((TIM_IT_TypeDef *) TIM1_IT_BASE)
#define TIM2_IT                     ((TIM_IT_TypeDef *) TIM2_IT_BASE)
#define SC1_IT                      ((SC_IT_TypeDef *) SC1_IT_BASE)
#define SC2_IT                      ((SC_IT_TypeDef *) SC2_IT_BASE)

#define SC2_DMA_ChannelRx           ((SC_DMA_Channel_TypeDef *) SC2_DMA_ChannelRx_BASE)
#define SC2_DMA_ChannelTx           ((SC_DMA_Channel_TypeDef *) SC2_DMA_ChannelTx_BASE)
#define SC2_DMA                     ((SC_DMA_TypeDef *) SC2_DMA_BASE)

#define SC1_DMA_ChannelRx           ((SC_DMA_Channel_TypeDef *) SC1_DMA_ChannelRx_BASE)
#define SC1_DMA_ChannelTx           ((SC_DMA_Channel_TypeDef *) SC1_DMA_ChannelTx_BASE)
#define SC1_DMA                     ((SC_DMA_TypeDef *) SC1_DMA_BASE)

/**
  * @}
  */

/** @defgroup PPP_Exported_Constants
  * @{
  */ 

/** @defgroup Peripheral_Registers_Bits_Definition 
  * @{
  */ 

/******************************************************************************/
/*                                                                            */
/*                        Clock Control (CLK)                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for CLK_SLEEPCR register  ***************/
#define  CLK_SLEEPCR_LSEEN                    ((uint32_t)0x00000001)       /*!< Enables 32kHz external XTAL */
#define  CLK_SLEEPCR_LSI10KEN                 ((uint32_t)0x00000002)       /*!< Enables 10kHz internal RC during deep */

/********************  Bit definition for CLK_LSI10KCR register  **************/
#define  CLK_LSI10KCR_TUNE                   ((uint32_t)0x0000000F)        /*!< Tune value for clkrc */

/********************  Bit definition for CLK_LSI1KCR register  ***************/
#define  CLK_LSI1KCR_CALFRAC                 ((uint32_t)0x000007FF)        /*!< Divider value fractional portion */
#define  CLK_LSI1KCR_CALINT                  ((uint32_t)0x0000F800)        /*!< Divider value integer portion */

/********************  Bit definition for CLK_HSECR1 register  ****************/
#define  CLK_HSECR1_BIASTRIM                 ((uint32_t)0x0000000F)        /*!< Bias trim setting for 24MHz oscillator */

/********************  Bit definition for CLK_HSICR register  *****************/
#define  CLK_HSICR_TUNE                      ((uint32_t)0x0000001F)        /*!< Frequency trim setting for HF RC oscillator */

/********************  Bit definition for CLK_HSECOMPR register  **************/
#define  CLK_HSECOMPR_HLEVEL                 ((uint32_t)0x00000002)        /*!< Frequency trim setting for HF RC oscillator */
#define  CLK_HSECOMPR_LLEVEL                 ((uint32_t)0x00000001)        /*!< Frequency trim setting for HF RC oscillator */

/********************  Bit definition for CLK_PERIODCR register  **************/
#define  CLK_PERIODCR_MODE                   ((uint32_t)0x00000003)        /*!< Sets clock to be measured by CLK_PERIOD */

/********************  Bit definition for CLK_PERIODSR register  **************/
#define  CLK_PERIODSR_PERIOD                 ((uint32_t)0x0000FFFF)        /*!< Clock period measurement */

/********************  Bit definition for CLK_DITHERCR register  **************/
#define  CLK_DITHERCR_DIS                    ((uint32_t)0x00000001)        /*!< Dither disable */

/********************  Bit definition for CLK_HSECR2 register  ****************/
#define  CLK_HSECR2_SW1                      ((uint32_t)0x00000001)        /*!< 0/1: OSCHF/XTAL is selected */
#define  CLK_HSECR2_EN                       ((uint32_t)0x00000002)        /*!< 1: 24 MHz crystal oscillator is main clock */

/********************  Bit definition for CLK_CPUCR register  *****************/
#define  CLK_CPUCR_SW2                       ((uint32_t)0x00000001)        /*!< 0/1: 12MHz/24MHz is selected */

/******************************************************************************/
/*                                                                            */
/*                        Reset Event source (RST)                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for RST_SR register  ********************/
#define  RST_SR_PWRHV                        ((uint32_t)0x00000001)        /*!< Normal power applied */
#define  RST_SR_PWRLV                        ((uint32_t)0x00000002)        /*!< The application of a Core power supply */
#define  RST_SR_PIN                          ((uint32_t)0x00000004)        /*!< External reset pin signal */
#define  RST_SR_WDG                          ((uint32_t)0x00000008)        /*!< Watchdog expiration */
#define  RST_SR_SWRST                        ((uint32_t)0x00000010)        /*!< Software reset */
#define  RST_SR_WKUP                         ((uint32_t)0x00000020)        /*!< Wake-up from Deep Sleep */
#define  RST_SR_OBFAIL                       ((uint32_t)0x00000040)        /*!< Option byte load failure */
#define  RST_SR_LKUP                         ((uint32_t)0x00000080)        /*!< Core lockup */

/******************************************************************************/
/*                                                                            */
/*                                    PWR                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for PWR_DSLEEPCR1 register  **************/
#define PWR_DSLEEPCR1_LVFREEZE               ((uint32_t)0x00000002)        /*!< Freeze state LV output states */

/*******************  Bit definition for PWR_DSLEEPCR2 register  **************/
#define PWR_DSLEEPCR2_MODE                   ((uint32_t)0x00000001)        /*!< Selects deep sleep mode 0 when the debugger is attached */

/*******************  Bit definition for PWR_VREGCR register  *****************/
#define PWR_VREGCR_VREFEN                    ((uint32_t)0x00008000)        /*!< VREF on/off */

#define PWR_VREGCR_1V8EN                     ((uint32_t)0x00000800)        /*!< 1V8 direct controle of regulator on/off */
#define PWR_VREGCR_1V8TRIM                   ((uint32_t)0x00000380)        /*!< 1V2 regulator trim value */

#define PWR_VREGCR_1V2EN                     ((uint32_t)0x00000010)        /*!< 1V2 direct controle of regulator on/off */
#define PWR_VREGCR_1V2TRIM                   ((uint32_t)0x00000007)        /*!< 1V2 regulator trim value */

/*******************  Bit definition for PWR_WAKECR1 register  ****************/
#define PWR_WAKECR1_CSYSPWRRUPREQ            ((uint32_t)0x00000200)        /*!< Wake up method on CSYSPWRUPREQ event */
#define PWR_WAKECR1_CPWRRUPREQ               ((uint32_t)0x00000100)        /*!< Wake up method on CPWRRUPREQ event */
#define PWR_WAKECR1_CORE                     ((uint32_t)0x00000080)        /*!< Wake up method on COREWAKE bit */
#define PWR_WAKECR1_WRAP                     ((uint32_t)0x00000040)        /*!< Wake up method on sleep timer compare wrap/overflow event */
#define PWR_WAKECR1_COMPB                    ((uint32_t)0x00000020)        /*!< Wake up method on sleep timer compare B event */
#define PWR_WAKECR1_COMPA                    ((uint32_t)0x00000010)        /*!< Wake up method on sleep timer compare A event */
#define PWR_WAKECR1_IRQD                     ((uint32_t)0x00000008)        /*!< Wake up method on falling/rising edge of pin PC0*/
#define PWR_WAKECR1_SC2                      ((uint32_t)0x00000004)        /*!< Wake up method on falling/rising edge of pin PA2 for SC2 */
#define PWR_WAKECR1_SC1                      ((uint32_t)0x00000002)        /*!< Wake up method on falling/rising edge of pin PB2 for SC1*/
#define PWR_WAKECR1_MONEN                    ((uint32_t)0x00000001)        /*!< Enable the GPIO monitoring to wake from deep sleep */

/*******************  Bit definition for PWR_WAKECR2 register  ****************/
#define PWR_WAKECR2_COREWAKE                 ((uint32_t)0x00000020)        /*!< Power up controlled by debug port activity */

/*******************  Bit definition for PWR_WAKESR register ******************/
#define PWR_WAKESR_CSYSPWRRUPREQ             ((uint32_t)0x00000200)        /*!< Wake up done using the DAP access to SYS registers */
#define PWR_WAKESR_CPWRRUPREQ                ((uint32_t)0x00000100)        /*!< Wake up done using the DAP access to DBG registers */
#define PWR_WAKESR_CORE                      ((uint32_t)0x00000080)        /*!< Wake up done using debug port activity */
#define PWR_WAKESR_WRAP                      ((uint32_t)0x00000040)        /*!< Wake up done using sleep timer wrap */
#define PWR_WAKESR_COMPB                     ((uint32_t)0x00000020)        /*!< Wake up done using sleep timer compare B */
#define PWR_WAKESR_COMPA                     ((uint32_t)0x00000010)        /*!< Wake up done using sleep timer compare A */
#define PWR_WAKESR_IRQD                      ((uint32_t)0x00000008)        /*!< Wake up done using external interrupt IRQD */
#define PWR_WAKESR_SC2                       ((uint32_t)0x00000004)        /*!< Wake up done using serial controller 2 (PA2) */
#define PWR_WAKESR_SC1                       ((uint32_t)0x00000002)        /*!< Wake up done using serial controller 1 (PB2) */
#define PWR_WAKESR_MON                       ((uint32_t)0x00000001)        /*!< Wake up done using GPIO monitoring */

/*******************  Bit definition for PWR_CPWRUPREQSR register  ************/
#define PWR_CPWRUPREQSR_REQ                  ((uint32_t)0x00000001)        /*!< Current value of CPWRUPREQ */

