jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/*******************  Bit definition for PWR_CSYSPWRUPREQSR register  *********/
#define PWR_CSYSPWRUPREQSR_REQ               ((uint32_t)0x00000001)        /*!< Current value of CSYSPWRUPREQ */

/*******************  Bit definition for PWR_CSYSPWRUPACKSR register  *********/
#define PWR_CSYSPWRUPACKSR_ACK               ((uint32_t)0x00000001)        /*!< Current value of CSYSPWRUPACK */

/*******************  Bit definition for PWR_CSYSPWRUPACKCR register  *********/
#define PWR_CSYSPWRUPACKCR_INHIBIT           ((uint32_t)0x00000001)        /*!< Inhibit CSYSPWRUPACK */

/*******************  Bit definition for PWR_WAKEPxR register  ****************/
#define PWR_WAKEPxR_Px0                      ((uint32_t)0x00000001)
#define PWR_WAKEPxR_Px1                      ((uint32_t)0x00000002)
#define PWR_WAKEPxR_Px2                      ((uint32_t)0x00000004)
#define PWR_WAKEPxR_Px3                      ((uint32_t)0x00000008)
#define PWR_WAKEPxR_Px4                      ((uint32_t)0x00000010)
#define PWR_WAKEPxR_Px5                      ((uint32_t)0x00000020)
#define PWR_WAKEPxR_Px6                      ((uint32_t)0x00000040)
#define PWR_WAKEPxR_Px7                      ((uint32_t)0x00000080)

/*******************  Bit definition for PWR_WAKEFILTR register  **************/
#define PWR_WAKEFILTR_GPIO                   ((uint32_t)0x00000001)        /*!< Enable filter on GPIO wakeup sources enabled by the PWR_WAKEPxR registers */
#define PWR_WAKEFILTR_SC1                    ((uint32_t)0x00000002)        /*!< Enable filter on GPIO wakeup source SC1 (PB2) */ 
#define PWR_WAKEFILTR_SC2                    ((uint32_t)0x00000004)        /*!< Enable filter on GPIO wakeup source SC2 (PA2) */ 
#define PWR_WAKEFILTR_IRQD                   ((uint32_t)0x00000008)        /*!< Enable filter on GPIO wakeup source EXTI D */ 

/******************************************************************************/
/*                                                                            */
/*                        Management interrupt (MGMT)                         */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MGMT_ISR register  ******************/
#define  MGMT_ISR_HSECOMPLLIF                ((uint32_t)0x00000001)        /*!< HSE COMP Low Level flag */
#define  MGMT_ISR_HSECOMPHLIF                ((uint32_t)0x00000002)        /*!< HSE COMP High Level flag */

/********************  Bit definition for MGMT_IER register  ******************/
#define  MGMT_IER_HSECOMPLLIE                ((uint32_t)0x00000001)        /*!< HSE COMP Low Level Interrupt source */
#define  MGMT_IER_HSECOMPHLIE                ((uint32_t)0x00000002)        /*!< HSE COMP High Level Interrupt source */


/******************************************************************************/
/*                                                                            */
/*                      General Purpose IOs (GPIO)                            */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for GPIO_CRL register  *******************/
#define GPIO_CRL_CNFMODE0                    ((uint32_t)0x0000000F)        /*!< CNFMODE0[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRL_CNFMODE0_0                  ((uint32_t)0x00000001)
#define GPIO_CRL_CNFMODE0_1                  ((uint32_t)0x00000002)
#define GPIO_CRL_CNFMODE0_2                  ((uint32_t)0x00000004)
#define GPIO_CRL_CNFMODE0_3                  ((uint32_t)0x00000008)
#define GPIO_CRL_CNFMODE1                    ((uint32_t)0x000000F0)        /*!< CNFMODE1[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRL_CNFMODE1_0                  ((uint32_t)0x00000010)
#define GPIO_CRL_CNFMODE1_1                  ((uint32_t)0x00000020)
#define GPIO_CRL_CNFMODE1_2                  ((uint32_t)0x00000040)
#define GPIO_CRL_CNFMODE1_3                  ((uint32_t)0x00000080)
#define GPIO_CRL_CNFMODE2                    ((uint32_t)0x00000F00)        /*!< CNFMODE2[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRL_CNFMODE2_0                  ((uint32_t)0x00000100)
#define GPIO_CRL_CNFMODE2_1                  ((uint32_t)0x00000200)
#define GPIO_CRL_CNFMODE2_2                  ((uint32_t)0x00000400)
#define GPIO_CRL_CNFMODE2_3                  ((uint32_t)0x00000800)
#define GPIO_CRL_CNFMODE3                    ((uint32_t)0x0000F000)        /*!< CNFMODE3[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRL_CNFMODE3_0                  ((uint32_t)0x00001000)
#define GPIO_CRL_CNFMODE3_1                  ((uint32_t)0x00002000)
#define GPIO_CRL_CNFMODE3_2                  ((uint32_t)0x00004000)
#define GPIO_CRL_CNFMODE3_3                  ((uint32_t)0x00008000)

/*******************  Bit definition for GPIO_CRH register  *******************/
#define GPIO_CRH_CNFMODE4                    ((uint32_t)0x0000000F)        /*!< CNFMODE4[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRH_CNFMODE4_0                  ((uint32_t)0x00000001)
#define GPIO_CRH_CNFMODE4_1                  ((uint32_t)0x00000002)
#define GPIO_CRH_CNFMODE4_2                  ((uint32_t)0x00000004)
#define GPIO_CRH_CNFMODE4_3                  ((uint32_t)0x00000008)
#define GPIO_CRH_CNFMODE5                    ((uint32_t)0x000000F0)        /*!< CNFMODE5[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRH_CNFMODE5_0                  ((uint32_t)0x00000010)
#define GPIO_CRH_CNFMODE5_1                  ((uint32_t)0x00000020)
#define GPIO_CRH_CNFMODE5_2                  ((uint32_t)0x00000040)
#define GPIO_CRH_CNFMODE5_3                  ((uint32_t)0x00000080)
#define GPIO_CRH_CNFMODE6                    ((uint32_t)0x00000F00)        /*!< CNFMODE6[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRH_CNFMODE6_0                  ((uint32_t)0x00000100)
#define GPIO_CRH_CNFMODE6_1                  ((uint32_t)0x00000200)
#define GPIO_CRH_CNFMODE6_2                  ((uint32_t)0x00000400)
#define GPIO_CRH_CNFMODE6_3                  ((uint32_t)0x00000800)
#define GPIO_CRH_CNFMODE7                    ((uint32_t)0x0000F000)        /*!< CNFMODE7[3:0] bits (GPIO Configuration and Mode Control) */
#define GPIO_CRH_CNFMODE7_0                  ((uint32_t)0x00001000)
#define GPIO_CRH_CNFMODE7_1                  ((uint32_t)0x00002000)
#define GPIO_CRH_CNFMODE7_2                  ((uint32_t)0x00004000)
#define GPIO_CRH_CNFMODE7_3                  ((uint32_t)0x00008000)

