jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/*******************  Bit definition for GPIO_IDR register     ****************/ 
#define GPIO_IDR_IDR0                        ((uint32_t)0x00000001)
#define GPIO_IDR_IDR1                        ((uint32_t)0x00000002)
#define GPIO_IDR_IDR2                        ((uint32_t)0x00000004)
#define GPIO_IDR_IDR3                        ((uint32_t)0x00000008)
#define GPIO_IDR_IDR4                        ((uint32_t)0x00000010)
#define GPIO_IDR_IDR5                        ((uint32_t)0x00000020)
#define GPIO_IDR_IDR6                        ((uint32_t)0x00000040)
#define GPIO_IDR_IDR7                        ((uint32_t)0x00000080)

/*******************  Bit definition for GPIO_ODR register     ****************/
#define GPIO_ODR_ODR0                        ((uint32_t)0x00000001)
#define GPIO_ODR_ODR1                        ((uint32_t)0x00000002)
#define GPIO_ODR_ODR2                        ((uint32_t)0x00000004)
#define GPIO_ODR_ODR3                        ((uint32_t)0x00000008)
#define GPIO_ODR_ODR4                        ((uint32_t)0x00000010)
#define GPIO_ODR_ODR5                        ((uint32_t)0x00000020)
#define GPIO_ODR_ODR6                        ((uint32_t)0x00000040)
#define GPIO_ODR_ODR7                        ((uint32_t)0x00000080)

/*******************  Bit definition for GPIO_BRR register     ****************/
#define GPIO_BRR_BR0                         ((uint32_t)0x00000001)
#define GPIO_BRR_BR1                         ((uint32_t)0x00000002)
#define GPIO_BRR_BR2                         ((uint32_t)0x00000004)
#define GPIO_BRR_BR3                         ((uint32_t)0x00000008)
#define GPIO_BRR_BR4                         ((uint32_t)0x00000010)
#define GPIO_BRR_BR5                         ((uint32_t)0x00000020)
#define GPIO_BRR_BR6                         ((uint32_t)0x00000040)
#define GPIO_BRR_BR7                         ((uint32_t)0x00000080)

/*******************  Bit definition for GPIO_BSR register     ****************/
#define GPIO_BSR_BS0                         ((uint32_t)0x00000001)
#define GPIO_BSR_BS1                         ((uint32_t)0x00000002)
#define GPIO_BSR_BS2                         ((uint32_t)0x00000004)
#define GPIO_BSR_BS3                         ((uint32_t)0x00000008)
#define GPIO_BSR_BS4                         ((uint32_t)0x00000010)
#define GPIO_BSR_BS5                         ((uint32_t)0x00000020)
#define GPIO_BSR_BS6                         ((uint32_t)0x00000040)
#define GPIO_BSR_BS7                         ((uint32_t)0x00000080)

/********************  Bit definition for GPIO_PCTRACECR register  *************/
#define  GPIO_PCTRACECR_SEL                  ((uint32_t)0x00000001)        /*!< selects PC_TRACE source on bb_debug GPIO pins */

/*******************  Bit definition for GPIO_DBGCR   register ****************/
#define GPIO_DBGCR_PADDRIVE                  ((uint32_t)0x00000008)        /*!< Global Pad drive strength */
#define GPIO_DBGCR_EXTREGEN                  ((uint32_t)0x00000010)        /*!< Disable REG_EN override of PA7's normal GPIO configuration */
#define GPIO_DBGCR_DBGDIS                    ((uint32_t)0x00000020)        /*!< Disable debug interface override of normal GPIO configuration */
/*******************  Bit definition for GPIO_DBGSR register   ****************/
#define GPIO_DBGSR_SWEN                      ((uint32_t)0x00000001)        /*!< Status of Serial Wire interface */
#define GPIO_DBGSR_FORCEDBG                  ((uint32_t)0x00000002)        /*!< Status of debugger interface */
#define GPIO_DBGSR_BOOTMODE                  ((uint32_t)0x00000008)        /*!< Status of the nBOOTMODE signal sampled at the end of reset */
/******************************************************************************/
/*                                                                            */
/*                                      EXTI                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for EXTI_CR register  ********************/
#define EXTI_CR_GPIO_SEL                     ((uint32_t)0x0000001F)        /*!< GPIO_SEL[4:0]bits  (GPIO EXTIx Selection) */
#define EXTI_CR_GPIO_SEL_0                   ((uint32_t)0x00000001)        /*!< bit0 */
#define EXTI_CR_GPIO_SEL_1                   ((uint32_t)0x00000002)        /*!< bit1 */
#define EXTI_CR_GPIO_SEL_2                   ((uint32_t)0x00000004)        /*!< bit2 */
#define EXTI_CR_GPIO_SEL_3                   ((uint32_t)0x00000008)        /*!< bit3 */
#define EXTI_CR_GPIO_SEL_4                   ((uint32_t)0x00000010)        /*!< bit4 */

/*******************  Bit definition for EXTI_TSR register     ****************/
#define EXTI_TSR_INTMOD                      ((uint32_t)0x000000E0)        /*!< INTMOD[7:5]bits  (EXTIx triggering mode) */
#define EXTI_TSR_INTMOD_0                    ((uint32_t)0x00000020)        /*!< bit5 */
#define EXTI_TSR_INTMOD_1                    ((uint32_t)0x00000040)        /*!< bit6 */
#define EXTI_TSR_INTMOD_2                    ((uint32_t)0x00000080)        /*!< bit7 */

#define EXTI_TSR_FILTEN                      ((uint32_t)0x00000100)        /*!< Set this bit to enable digital filtering on EXTIx */

/*******************  Bit definition for EXTI_PR register      ****************/
#define EXTI_PR_IRQAP                        ((uint32_t)0x00000001)        /*!< EXTIA interrupt pending */
#define EXTI_PR_IRQBP                        ((uint32_t)0x00000002)        /*!< EXTIB interrupt pending */
#define EXTI_PR_IRQCP                        ((uint32_t)0x00000004)        /*!< EXTIC interrupt pending */
#define EXTI_PR_IRQDP                        ((uint32_t)0x00000008)        /*!< EXTID interrupt pending */

/******************************************************************************/
/*                                                                            */
/*                                    WDG                                     */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WDG_CR  register *********************/
#define WDG_CR_WDGEN                         ((uint32_t)0x00000001)        /*!< WDG enable */
#define WDG_CR_WDGDIS                        ((uint32_t)0x00000002)        /*!< WDG disable */

