jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/*******************  Bit definition for WDG_KR  register *********************/
#define WDG_KR_KEY                           ((uint32_t)0x0000FFFF)        /*!< WDG key value */

/*******************  Bit definition for WDG_KICKSR  register *****************/
#define WDG_KICKSR_KS                        ((uint32_t)0x0000FFFF)        /*!< WDG kick start value */

/******************************************************************************/
/*                                                                            */
/*                               Sleep Timer                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SLPTMR_CR  register ******************/
#define SLPTMR_CR_CLKSEL                     ((uint32_t)0x00000001)        /*!< clock select */
#define SLPTMR_CR_PSC                        ((uint32_t)0x000000F0)        /*!< Sleep timer prescaler setting */
#define SLPTMR_CR_DBGP                       ((uint32_t)0x00000400)        /*!< Debug Pause */
#define SLPTMR_CR_EN                         ((uint32_t)0x00000800)        /*!< Enable/Disable Sleep Timer */
#define SLPTMR_CR_REVERSE                    ((uint32_t)0x00001000)        /*!< count forward or backword */

/*******************  Bit definition for SLPTMR_CNTH register *****************/
#define SLPTMR_CNTH_CNTH                     ((uint32_t)0x0000FFFF)        /*!< Sleep timer count high register */

/*******************  Bit definition for SLPTMR_CNTL register *****************/
#define SLPTMR_CNTL_CNTL                     ((uint32_t)0x0000FFFF)        /*!< Sleep timer count low register */

/*******************  Bit definition for SLPTMR_CMPAH register ****************/
#define SLPTMR_CMPAH_CMPAH                   ((uint32_t)0x0000FFFF)        /*!< Sleep timer compare A high register */

/*******************  Bit definition for SLPTMR_CMPAL register ****************/
#define SLPTMR_CMPAL_CMPAL                   ((uint32_t)0x0000FFFF)        /*!< Sleep timer compare A low register */

/*******************  Bit definition for SLPTMR_CMPBH register ****************/
#define SLPTMR_CMPBH_CMPBH                   ((uint32_t)0x0000FFFF)        /*!< Sleep timer compare B high register */

/*******************  Bit definition for SLPTMR_CMPBL register ****************/
#define SLPTMR_CMPBL_CMPBL                   ((uint32_t)0x0000FFFF)        /*!< Sleep timer compare B low register */

/*******************  Bit definition for SLPTMR_ISR register ******************/
#define SLPTMR_ISR_WRAP                      ((uint32_t)0x00000001)        /*!< Sleep timer overflow */
#define SLPTMR_ISR_CMPA                      ((uint32_t)0x00000002)        /*!< Sleep timer compare A */
#define SLPTMR_ISR_CMPB                      ((uint32_t)0x00000004)        /*!< Sleep timer compare B */

/*******************  Bit definition for SLPTMR_IFR register ******************/
#define SLPTMR_IFR_WRAP                      ((uint32_t)0x00000001)        /*!< Sleep timer overflow */
#define SLPTMR_IFR_CMPA                      ((uint32_t)0x00000002)        /*!< Sleep timer compare A */
#define SLPTMR_IFR_CMPB                      ((uint32_t)0x00000004)        /*!< Sleep timer compare B */

/*******************  Bit definition for SLPTMR_IER   register ****************/
#define SLPTMR_IER_WRAP                      ((uint32_t)0x00000001)        /*!< Sleep timer overflow */
#define SLPTMR_IER_CMPA                      ((uint32_t)0x00000002)        /*!< Sleep timer compare A */
#define SLPTMR_IER_CMPB                      ((uint32_t)0x00000004)        /*!< Sleep timer compare B */

/******************************************************************************/
/*                                                                            */
/*                                 MAC Timer                                  */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SLPTMR_CNTR register *****************/
#define MACTMR_CNTR_CNT                     ((uint32_t)0x000FFFFF)         /*!< MAC timer count register */

/********************  Bit definition for MACTMR_CR register ******************/
#define MACTMR_CR_EN                        ((uint32_t)0x00000001)         /*!< MAC timer enable */
#define MACTMR_CR_RST                       ((uint32_t)0x00000002)         /*!< MAC timer reset */

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter (ADC)                   */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for ADC_CR register  ********************/

#define  ADC_CR_ADON                         ((uint32_t)0x00000001)        /*!< ADC enable */
#define  ADC_CR_CLK                          ((uint32_t)0x00000004)        /*!< Clock selection */

/*!< MUXN configuration */
#define  ADC_CR_CHSELN                       ((uint32_t)0x00000078)        /*!< Input selection for the N channel */
#define  ADC_CR_CHSELN_0                     ((uint32_t)0x00000008)        /*!< Bit0 */
#define  ADC_CR_CHSELN_1                     ((uint32_t)0x00000010)        /*!< Bit1 */
#define  ADC_CR_CHSELN_2                     ((uint32_t)0x00000020)        /*!< Bit2 */
#define  ADC_CR_CHSELN_3                     ((uint32_t)0x00000040)        /*!< Bit3 */

/*!< MUXP configuration */
#define  ADC_CR_CHSELP                       ((uint32_t)0x00000780)        /*!< Input selection for the P channel */
#define  ADC_CR_CHSELP_0                     ((uint32_t)0x00000080)        /*!< Bit0 */
#define  ADC_CR_CHSELP_1                     ((uint32_t)0x00000100)        /*!< Bit1 */
#define  ADC_CR_CHSELP_2                     ((uint32_t)0x00000200)        /*!< Bit2 */
#define  ADC_CR_CHSELP_3                     ((uint32_t)0x00000400)        /*!< Bit3 */

/*!< HVSELN configuration */
#define  ADC_CR_HVSELN                       ((uint32_t)0x00000800)        /*!< Select voltage range for the N input channel */

/*!< HVSELP configuration */
#define  ADC_CR_HVSELP                       ((uint32_t)0x00001000)        /*!< Select voltage range for the P input channel */

/*!< PERIOD configuration */
#define  ADC_CR_SMP                          ((uint32_t)0x0000E000)        /*!< ADC sample time in clocks */
#define  ADC_CR_SMP_0                        ((uint32_t)0x00002000)        /*!< Bit0 */
#define  ADC_CR_SMP_1                        ((uint32_t)0x00004000)        /*!< Bit1 */
#define  ADC_CR_SMP_2                        ((uint32_t)0x00008000)        /*!< Bit2 */

/********************  Bit definition for ADC_OFFSETR register  ***************/

