jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
#define  ADC_OFFSETR_OFFSET                  ((uint32_t)0x0000FFFF)        /*!< 16-bit signed offset added to the basic ADC conversion 
                                                                                result before gain correction is applied.*/

/********************  Bit definition for ADC_GAINR register  *****************/

#define  ADC_GAINR_GAIN                      ((uint32_t)0x0000FFFF)        /*!< Gain factor that is multiplied by the offset-corrected 
                                                                                ADC result to produce the output value */
/********************  Bit definition for ADC_DMACR register  *****************/

#define  ADC_DMACR_LOAD                      ((uint32_t)0x00000001)        /*!< Starts the ADC DMA */
#define  ADC_DMACR_AUTOWRAP                  ((uint32_t)0x00000002)        /*!< Selects DMA mode */
#define  ADC_DMACR_RST                       ((uint32_t)0x00000010)        /*!< Reset the ADC DMA */

/********************  Bit definition for ADC_DMASR register  *****************/

#define  ADC_DMASR_ACT                       ((uint32_t)0x00000001)        /*!< DMA active */
#define  ADC_DMASR_OVF                       ((uint32_t)0x00000002)        /*!< DMA overflow */

/********************  Bit definition for ADC_DMAMSAR register  ***************/

#define  ADC_DMAMSAR_MSA                     ((uint32_t)0x00003FFF)        /*!< ADC buffer start address */

/********************  Bit definition for ADC_DMANDTR register  ***************/

#define  ADC_DMANDTR_NDT                     ((uint32_t)0x00001FFF)        /*!< ADC buffer size */

/********************  Bit definition for ADC_DMAMNAR register  ***************/

#define  ADC_DMAMNAR_MNA                     ((uint32_t)0x00003FFE)        /*!< Current DMA address */

/********************  Bit definition for ADC_DMACNDTR register  **************/

#define  ADC_DMACNDTR_CNDT                   ((uint32_t)0x00001FFF)        /*!< The number of 16-bit conversion results that have been
                                                                                     written to the buffer */
/********************  Bit definition for ADC_ISR register  *******************/

#define  ADC_ISR_ADCFLAG                     ((uint32_t)0x0000001F)        /*!< ADC interrupt flag register */
#define  ADC_ISR_ADCFLAG_0                   ((uint32_t)0x00000001)        /*!< Bit0: reserved and should always be set to 1 */
#define  ADC_ISR_DMABHF                      ((uint32_t)0x00000002)        /*!< DMA buffer half full interrupt pending */
#define  ADC_ISR_DMABF                       ((uint32_t)0x00000004)        /*!< DMA buffer full interrupt pending */
#define  ADC_ISR_SAT                         ((uint32_t)0x00000008)        /*!< Gain correction saturation interrupt pending */
#define  ADC_ISR_DMAOVF                      ((uint32_t)0x00000010)        /*!< DMA buffer overflow interrupt pending */

/********************  Bit definition for ADC_IER register  *******************/

#define  ADC_IER_ADCCFG                      ((uint32_t)0x0000001F)        /*!< ADC interrupt configuration register */
#define  ADC_IER_ADCCFG_0                    ((uint32_t)0x00000001)        /*!< Bit0: reserved and should always be set to 0 */
#define  ADC_IER_DMABHFIE                    ((uint32_t)0x00000002)        /*!< DMA buffer half full interrupt enable */
#define  ADC_IER_DMABFIE                     ((uint32_t)0x00000004)        /*!< DMA buffer full interrupt enable */
#define  ADC_IER_SATIE                       ((uint32_t)0x00000008)        /*!< Gain correction saturation interrupt enable */
#define  ADC_IER_DMAOVFIE                    ((uint32_t)0x00000010)        /*!< DMA buffer overflow interrupt enable */

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                   ((uint32_t)0x00000007)        /*!< LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                 ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  FLASH_ACR_LATENCY_1                 ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  FLASH_ACR_LATENCY_2                 ((uint32_t)0x00000004)        /*!< Bit 2 */

#define  FLASH_ACR_HLFCYA                    ((uint32_t)0x00000008)        /*!< Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                    ((uint32_t)0x00000010)        /*!< Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                    ((uint32_t)0x00000020)        /*!< Prefetch Buffer Status */

/******************  Bit definition for FLASH_KEYR register  ******************/
#define  FLASH_KEYR_FKEYR                    ((uint32_t)0xFFFFFFFF)        /*!< FPEC Key */

/*****************  Bit definition for FLASH_OPTKEYR register  ****************/
#define  FLASH_OPTKEYR_OPTKEYR               ((uint32_t)0xFFFFFFFF)        /*!< Option Byte Key */

/******************  Bit definition for FLASH_SR register  ********************/
#define  FLASH_SR_BSY                        ((uint32_t)0x00000001)        /*!< Busy */
#define  FLASH_SR_PGERR                      ((uint32_t)0x00000004)        /*!< Programming Error */
#define  FLASH_SR_WRPRTERR                   ((uint32_t)0x00000010)        /*!< Write Protection Error */
#define  FLASH_SR_EOP                        ((uint32_t)0x00000020)        /*!< End of operation */

/*******************  Bit definition for FLASH_CR register  *******************/
#define  FLASH_CR_PG                         ((uint32_t)0x00000001)        /*!< Programming */
#define  FLASH_CR_PER                        ((uint32_t)0x00000002)        /*!< Page Erase */
#define  FLASH_CR_MER                        ((uint32_t)0x00000004)        /*!< Mass Erase */
#define  FLASH_CR_OPTPG                      ((uint32_t)0x00000010)        /*!< Option Byte Programming */
#define  FLASH_CR_OPTER                      ((uint32_t)0x00000020)        /*!< Option Byte Erase */
#define  FLASH_CR_STRT                       ((uint32_t)0x00000040)        /*!< Start */
#define  FLASH_CR_LOCK                       ((uint32_t)0x00000080)        /*!< Lock */
#define  FLASH_CR_OPTWRE                     ((uint32_t)0x00000200)        /*!< Option Bytes Write Enable */
#define  FLASH_CR_ERRIE                      ((uint32_t)0x00000400)        /*!< Error Interrupt Enable */
#define  FLASH_CR_EOPIE                      ((uint32_t)0x00001000)        /*!< End of operation interrupt enable */

/*******************  Bit definition for FLASH_AR register  *******************/
#define  FLASH_AR_FAR                        ((uint32_t)0xFFFFFFFF)        /*!< Flash Address */

/******************  Bit definition for FLASH_OBR register  *******************/
#define  FLASH_OBR_OPTERR                    ((uint32_t)0x00000001)        /*!< Option Byte Error */
#define  FLASH_OBR_RDPRT                     ((uint32_t)0x00000002)        /*!< Read protection */

/******************  Bit definition for FLASH_WRPR register  ******************/
#define  FLASH_WRPR_WRP                      ((uint32_t)0xFFFFFFFF)        /*!< Write Protect */

/******************  Bit definition for FLASH_CLKER register  *****************/
#define  FLASH_CLKER_EN                      ((uint32_t)0x00000001)        /*!< Request enabling of FPEC_CLK */

/******************  Bit definition for FLASH_CLKSR register  ******************/
#define  FLASH_CLKSR_ACK                     ((uint32_t)0x00000001)        /*!< Indicates FPEC_CLK is running and FCLK is 12MHz */
#define  FLASH_CLKSR_BSY                     ((uint32_t)0x00000002)        /*!< Indicates FPEC is Busy */

