jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_RDP register  *******************/
#define  FLASH_RDP_RDP                       ((uint32_t)0x000000FF)        /*!< Read protection option byte */
#define  FLASH_RDP_nRDP                      ((uint32_t)0x0000FF00)        /*!< Read protection complemented option byte */

/******************  Bit definition for FLASH_Rsvd0 register ******************/
#define  FLASH_Rsvd0_Rsvd0                   ((uint32_t)0x00FF0000)        /*!< Reserved option byte */
#define  FLASH_Rsvd0_nRsvd0                  ((uint32_t)0xFF000000)        /*!< Reserved complemented option byte */

/******************  Bit definition for FLASH_Rsvd1 register  *****************/
#define  FLASH_Rsvd1_Rsvd1                   ((uint32_t)0x000000FF)        /*!< Reserved option byte */
#define  FLASH_Rsvd1_nRsvd1                  ((uint32_t)0x0000FF00)        /*!< Reserved complemented option byte */

/******************  Bit definition for FLASH_Rsvd2 register  *****************/
#define  FLASH_Rsvd2_Rsvd2                   ((uint32_t)0x00FF0000)        /*!< Reserved option byte */
#define  FLASH_Rsvd2_nRsvd2                   ((uint32_t)0xFF000000)       /*!< Reserved complemented option byte */

/******************  Bit definition for FLASH_WRP0 register  ******************/
#define  FLASH_WRP0_WRP0                     ((uint32_t)0x000000FF)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP0_nWRP0                    ((uint32_t)0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP1 register  ******************/
#define  FLASH_WRP1_WRP1                     ((uint32_t)0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP1_nWRP1                    ((uint32_t)0xFF000000)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP2 register  ******************/
#define  FLASH_WRP2_WRP2                     ((uint32_t)0x000000FF)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP2_nWRP2                    ((uint32_t)0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRP3 register  ******************/
#define  FLASH_WRP3_WRP3                     ((uint32_t)0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRP3_nWRP3                    ((uint32_t)0xFF000000)        /*!< Flash memory write protection complemented option bytes */
/******************************************************************************/
/*                                                                            */
/*                       Serial Controllers Interface                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for SC_ISR register  ********************/

#define  SC_ISR_PE                           ((uint32_t)0x00004000)        /*!< UART Parity error pending interrupt */
#define  SC_ISR_FE                           ((uint32_t)0x00002000)        /*!< UART Frame error pending interrupt */
#define  SC_ISR_TXULODB                      ((uint32_t)0x00001000)        /*!< DMA transmit buffer B unloaded pending interrupt */
#define  SC_ISR_TXULODA                      ((uint32_t)0x00000800)        /*!< DMA transmit buffer A unloaded pending interrupt */
#define  SC_ISR_RXULODB                      ((uint32_t)0x00000400)        /*!< DMA receive buffer B unloaded pending interrupt */
#define  SC_ISR_RXULODA                      ((uint32_t)0x00000200)        /*!< DMA receive buffer A unloaded pending interrupt */
#define  SC_ISR_NACK                         ((uint32_t)0x00000100)        /*!< I2C not acknowledge received pending interrupt */
#define  SC_ISR_CMDFIN                       ((uint32_t)0x00000080)        /*!< I2C command complete detection pending interrupt */
#define  SC_ISR_BTF                          ((uint32_t)0x00000040)        /*!< I2C byte transmit finished pending interrupt */
#define  SC_ISR_BRF                          ((uint32_t)0x00000020)        /*!< I2C byte receive finished pending interrupt */
#define  SC_ISR_UND                          ((uint32_t)0x00000010)        /*!< Underrun pending interrupt */
#define  SC_ISR_OVR                          ((uint32_t)0x00000008)        /*!< Overrun pending interrupt */
#define  SC_ISR_IDLE                         ((uint32_t)0x00000004)        /*!< IDLE line detection pending interrupt */
#define  SC_ISR_TXE                          ((uint32_t)0x00000002)        /*!< Transmit data register empty pending interrupt */
#define  SC_ISR_RXNE                         ((uint32_t)0x00000001)        /*!< Data register not empty pending interrupt */

/********************  Bit definition for SC_IER register  ********************/

#define  SC_IER_PEIE                         ((uint32_t)0x00004000)        /*!< UART Parity error interrupt enable */
#define  SC_IER_FEIE                         ((uint32_t)0x00002000)        /*!< UART Frame error interrupt enable */
#define  SC_IER_TXULODBIE                    ((uint32_t)0x00001000)        /*!< DMA transmit buffer B unloaded interrupt enable */
#define  SC_IER_TXULODAIE                    ((uint32_t)0x00000800)        /*!< DMA transmit buffer A unloaded interrupt enable */
#define  SC_IER_RXULODBIE                    ((uint32_t)0x00000400)        /*!< DMA receive buffer B unloaded interrupt enable */
#define  SC_IER_RXULODAIE                    ((uint32_t)0x00000200)        /*!< DMA receive buffer A unloaded interrupt enable */
#define  SC_IER_NACKIE                       ((uint32_t)0x00000100)        /*!< I2C not acknowledge received interrupt enable */
#define  SC_IER_CMDFINIE                     ((uint32_t)0x00000080)        /*!< I2C command complete detection interrupt enable */
#define  SC_IER_BTFIE                        ((uint32_t)0x00000040)        /*!< I2C byte transmit finished interrupt enable */
#define  SC_IER_BRFIE                        ((uint32_t)0x00000020)        /*!< I2C byte receive finished interrupt enable */
#define  SC_IER_UNDIE                        ((uint32_t)0x00000010)        /*!< Underrun interrupt enable */
#define  SC_IER_OVRIE                        ((uint32_t)0x00000008)        /*!< Overrun interrupt enable */
#define  SC_IER_IDLEIE                       ((uint32_t)0x00000004)        /*!< IDLE line detection interrupt enable */
#define  SC_IER_TXEIE                        ((uint32_t)0x00000002)        /*!< Transmit data register empty interrupt enable */
#define  SC_IER_RXNEIE                       ((uint32_t)0x00000001)        /*!< Data register not empty interrupt enable */

