jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/********************  Bit definition for SC_ICR register  ********************/
#define  SC_ICR_IDLELEVEL                    ((uint32_t)0x00000004)        /*!< Trigger event configuration to generate the IDLE interrupt */
#define  SC_ICR_TXELEVEL                     ((uint32_t)0x00000002)        /*!< Trigger event configuration to generate the TXE interrupt */
#define  SC_ICR_RXNELEVEL                    ((uint32_t)0x00000001)        /*!< Trigger event configuration to generate the RXNE interrupt */
   
/********************  Bit definition for SC_DMARXBEGADDAR register  **********/
#define  SC_DMARXBEGADDAR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelA Rx begin address */

/********************  Bit definition for SC_DMARXENDADDAR register  **********/
#define  SC_DMARXENDADDAR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelA Rx end address */

/********************  Bit definition for SC_DMARXBEGADDBR register  **********/
#define  SC_DMARXBEGADDBR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelB Rx begin address */

/********************  Bit definition for SC_DMARXENDADDBR register  **********/
#define  SC_DMARXENDADDBR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelB Rx end address */
   
/********************  Bit definition for SC_DMATXBEGADDAR register  **********/
#define  SC_DMATXBEGADDAR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelA Tx begin address */

/********************  Bit definition for SC_DMARXENDADDBR register  **********/
#define  SC_DMATXENDADDAR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelA Tx end address */
   
/********************  Bit definition for SC_DMATXBEGADDBR register  **********/
#define  SC_DMATXBEGADDBR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelB Tx begin address */

/********************  Bit definition for SC_DMARXENDADDBR register  **********/
#define  SC_DMATXENDADDBR_ADD                ((uint32_t)0x00003FFF)        /*!< DMA channelB Tx end address */

/********************  Bit definition for SC_DMARXCNTAR register  *************/
#define  SC_DMARXCNTAR_CNT                   ((uint32_t)0x00003FFF)        /*!< Receive DMA counter A */
  
/********************  Bit definition for SC_DMARXCNTBR register  *************/
#define  SC_DMARXCNTBR_CNT                   ((uint32_t)0x00003FFF)        /*!< Receive DMA counter B */
    
/********************  Bit definition for SC_DMATXCNTR register  **************/
#define  SC_DMATXCNTR_CNT                    ((uint32_t)0x00003FFF)        /*!< Transmit DMA counter */
 
/********************  Bit definition for SC_DMASR register  ******************/
#define  SC_DMASR_NSSS                       ((uint32_t)0x00001C00)        /*!< NSSS[2:0] Status of the receiver count saved in the SCx_DMARXCNTSAVEDR when nSSEL deasserts */
#define  SC_DMASR_NSSS_0                     ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  SC_DMASR_NSSS_1                     ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  SC_DMASR_NSSS_2                     ((uint32_t)0x00001000)        /*!< Bit 2 */

#define  SC_DMASR_FEB                        ((uint32_t)0x00000200)        /*!< DMA channel B Frame error flag */
#define  SC_DMASR_FEA                        ((uint32_t)0x00000100)        /*!< DMA channel A Frame error flag */
#define  SC_DMASR_PEB                        ((uint32_t)0x00000080)        /*!< DMA channel B Parity error flag */
#define  SC_DMASR_PEA                        ((uint32_t)0x00000040)        /*!< DMA channel A Parity error flag */
#define  SC_DMASR_OVRB                       ((uint32_t)0x00000020)        /*!< DMA channel B overrun error flag */
#define  SC_DMASR_OVRA                       ((uint32_t)0x00000010)        /*!< DMA channel A overrun error flag */
#define  SC_DMASR_TXBACK                     ((uint32_t)0x00000008)        /*!< DMA Transmit channel B ACK flag */
#define  SC_DMASR_TXAACK                     ((uint32_t)0x00000004)        /*!< DMA Transmit channel A ACK flag */
#define  SC_DMASR_RXBACK                     ((uint32_t)0x00000002)        /*!< DMA Receive channel B ACK flag */
#define  SC_DMASR_RXAACK                     ((uint32_t)0x00000001)        /*!< DMA Receive channel B ACK flag */

/********************  Bit definition for SC_DMACR register  ******************/
#define  SC_DMACR_TXRST                      ((uint32_t)0x00000020)        /*!< DMA transmit Channels reset */
#define  SC_DMACR_RXRST                      ((uint32_t)0x00000010)        /*!< DMA receive Channels reset */
#define  SC_DMACR_TXLODB                     ((uint32_t)0x00000008)        /*!< DMA transmit Channel B load */
#define  SC_DMACR_TXLODA                     ((uint32_t)0x00000004)        /*!< DMA transmit Channel A load */
#define  SC_DMACR_RXLODB                     ((uint32_t)0x00000002)        /*!< DMA receive Channel B load */
#define  SC_DMACR_RXLODA                     ((uint32_t)0x00000001)        /*!< DMA receive Channel A load */

/********************  Bit definition for SC_DMARXERRAR register  *************/
#define  SC_DMARXERRAR_ADD                   ((uint32_t)0x00003FFF)                   /*! DMA receive channel A error offset address */

/********************  Bit definition for SC_DMARXERRBR register  *************/
#define  SC_DMARXERRBR_ADD                   ((uint32_t)0x00003FFF)                   /*! DMA receive channel B error offset address */

/********************  Bit definition for SC_DR register  *********************/
#define  SC_DR_DR                            ((uint32_t)0x000000FF)        /*!< Data value */

/********************  Bit definition for SC_SPISR register  ******************/
#define  SC_SPISR_IDLE                       ((uint32_t)0x00000008)        /*!< SPI Idle line detected flag */
#define  SC_SPISR_TXE                        ((uint32_t)0x00000004)        /*!< SPI Transmit data register empty flag */
#define  SC_SPISR_RXNE                       ((uint32_t)0x00000002)        /*!< SPI Data register not empty flag */
#define  SC_SPISR_OVR                        ((uint32_t)0x00000001)        /*!< SPI Overrun flag */

/********************  Bit definition for SC_I2CSR register  ******************/
#define  SC_I2CSR_CMDFIN                     ((uint32_t)0x00000008)        /*!< I2C Command finished flag */
#define  SC_I2CSR_BRF                        ((uint32_t)0x00000004)        /*!< I2C Byte received finished flag */
#define  SC_I2CSR_BTF                        ((uint32_t)0x00000002)        /*!< I2C Byte transfer finished flag  */
#define  SC_I2CSR_NACK                       ((uint32_t)0x00000001)        /*!< I2C Not acknowledge flag */

/********************  Bit definition for SC_UARTSR register  *****************/
#define  SC_UARTSR_IDLE                      ((uint32_t)0x00000040)        /*!< UART Idle line detected flag */
#define  SC_UARTSR_PE                        ((uint32_t)0x00000020)        /*!< UART Parity error flag */
#define  SC_UARTSR_FE                        ((uint32_t)0x00000010)        /*!< UART Frame error flag */
#define  SC_UARTSR_OVR                       ((uint32_t)0x00000008)        /*!< UART Overrun flag */
#define  SC_UARTSR_TXE                       ((uint32_t)0x00000004)        /*!< UART Transmit data register empty flag */
#define  SC_UARTSR_RXNE                      ((uint32_t)0x00000002)        /*!< UART Data register not empty flag */
#define  SC_UARTSR_CTS                       ((uint32_t)0x00000001)        /*!< UART Clear to send flag */

