jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/********************  Bit definition for SC_I2CCR1 register  *****************/
#define  SC_I2CCR1_STOP                      ((uint32_t)0x00000008)        /*!< I2C stop command generation */
#define  SC_I2CCR1_START                     ((uint32_t)0x00000004)        /*!< I2C start command generation */
#define  SC_I2CCR1_BTE                       ((uint32_t)0x00000002)        /*!< I2C byte transmit enable */
#define  SC_I2CCR1_BRE                       ((uint32_t)0x00000001)        /*!< I2C byte receive enable */

/********************  Bit definition for SC_I2CCR2 register  *****************/
#define  SC_I2CCR2_ACK                       ((uint32_t)0x00000001)        /*!< I2C Not Acknowledge generation */

/********************  Bit definition for SC_CR register  *********************/
#define  SC_CR_MODE                          ((uint32_t)0x00000003)        /*!< MODE[1:0] Serial controller mode selection */
#define  SC_CR_MODE_0                        ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  SC_CR_MODE_1                        ((uint32_t)0x00000002)        /*!< Bit 1 */
  
/********************  Bit definition for SC_SPICR register  ******************/
#define  SC_SPICR_RXMODE                     ((uint32_t)0x00000020)        /*!< SPI Receiver-driven mode */
#define  SC_SPICR_MSTR                       ((uint32_t)0x00000010)        /*!< SPI Master mode selection */
#define  SC_SPICR_RPTEN                      ((uint32_t)0x00000008)        /*!< SPI transmit Repeat enable */
#define  SC_SPICR_LSBFIRST                   ((uint32_t)0x00000004)        /*!< SPI frame format */
#define  SC_SPICR_CPHA                       ((uint32_t)0x00000002)        /*!< SPI clock phase */
#define  SC_SPICR_CPOL                       ((uint32_t)0x00000001)        /*!< SPI clock polarity */

/********************  Bit definition for SC_UARTCR register  *****************/
#define  SC_UARTCR_AHFCE                     ((uint32_t)0x00000040)        /*!< UART automatic hardware flow control enable */
#define  SC_UARTCR_HFCE                      ((uint32_t)0x00000020)        /*!< UART hardware flow control enable */
#define  SC_UARTCR_PS                        ((uint32_t)0x00000010)        /*!< UART parity selection */
#define  SC_UARTCR_PCE                       ((uint32_t)0x00000008)        /*!< UART parity control enable */
#define  SC_UARTCR_STOP                      ((uint32_t)0x00000004)        /*!< UART number of STOP bits */
#define  SC_UARTCR_M                         ((uint32_t)0x00000002)        /*!< UART word length */
#define  SC_UARTCR_nRTS                      ((uint32_t)0x00000001)        /*!< UART request to send */

/********************  Bit definition for SC_CRR1 register  *******************/
#define  SC_CRR1_LIN                         ((uint32_t)0x0000000F)        /*!< LIN[3:0] The linear component of the clock rate */
#define  SC_CRR1_LIN_0                       ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  SC_CRR1_LIN_1                       ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  SC_CRR1_LIN_2                       ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  SC_CRR1_LIN_3                       ((uint32_t)0x00000008)        /*!< Bit 3 */

/********************  Bit definition for SC_CRR2 register  *******************/
#define  SC_CRR2_EXP                         ((uint32_t)0x0000000F)        /*!< EXP[3:0] The exponential component of the clock rate */
#define  SC_CRR2_EXP_0                       ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  SC_CRR2_EXP_1                       ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  SC_CRR2_EXP_2                       ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  SC_CRR2_EXP_3                       ((uint32_t)0x00000008)        /*!< Bit 3 */

/********************  Bit definition for SC_UARTBRR1 register  ***************/
#define  SC_UARTBRR1_N                       ((uint32_t)0x0000FFFF)        /*!< N[15:0] The integer part of baud rate period */

/********************  Bit definition for SC_UARTBRR2 register  ***************/
#define  SC_UARTBRR1_F                       ((uint32_t)0x00000001)        /*!< The fractional part of baud rate period */

/********************  Bit definition for SC_DMARXCNTSAVEDR register  *********/
#define  SC_DMARXCNTSAVEDR_CNT               ((uint32_t)0x00003FFF)        /*!< DMA received counter in SPI slave mode when nSSEL deasserts */

/******************************************************************************/
/*                                                                            */
/*                                    TIM                                     */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for TIM_CR1 register  ********************/
#define  TIM_CR1_CEN                         ((uint32_t)0x00000001)        /*!< Counter enable */
#define  TIM_CR1_UDIS                        ((uint32_t)0x00000002)        /*!< Update disable */
#define  TIM_CR1_URS                         ((uint32_t)0x00000004)        /*!< Update request source */
#define  TIM_CR1_OPM                         ((uint32_t)0x00000008)        /*!< One pulse mode */
#define  TIM_CR1_DIR                         ((uint32_t)0x00000010)        /*!< Direction */

#define  TIM_CR1_CMS                         ((uint32_t)0x00000060)        /*!< CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CR1_CMS_0                       ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  TIM_CR1_CMS_1                       ((uint32_t)0x00000040)        /*!< Bit 1 */

#define  TIM_CR1_ARPE                        ((uint32_t)0x00000080)        /*!< Auto-reload Buffer enable */

#define  TIM_CR1_CKD                         ((uint32_t)0x00000300)        /*!< CKD[1:0] bits (clock division) */
#define  TIM_CR1_CKD_0                       ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  TIM_CR1_CKD_1                       ((uint32_t)0x00000200)        /*!< Bit 1 */

