jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/*******************  Bit definition for TIM_CR2 register  ********************/
#define  TIM_CR2_MMS                         ((uint32_t)0x00000070)        /*!< MMS[2:0] bits (Master Mode Selection) */
#define  TIM_CR2_MMS_0                       ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  TIM_CR2_MMS_1                       ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  TIM_CR2_MMS_2                       ((uint32_t)0x00000040)        /*!< Bit 2 */

#define  TIM_CR2_TI1S                        ((uint32_t)0x00000080)        /*!< TI1 Selection */

/*******************  Bit definition for TIM_SMCR register  *******************/
#define  TIM_SMCR_SMS                        ((uint32_t)0x00000007)        /*!< SMS[2:0] bits (Slave mode selection) */
#define  TIM_SMCR_SMS_0                      ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  TIM_SMCR_SMS_1                      ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  TIM_SMCR_SMS_2                      ((uint32_t)0x00000004)        /*!< Bit 2 */

#define  TIM_SMCR_TS                         ((uint32_t)0x00000070)        /*!< TS[2:0] bits (Trigger selection) */
#define  TIM_SMCR_TS_0                       ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  TIM_SMCR_TS_1                       ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  TIM_SMCR_TS_2                       ((uint32_t)0x00000040)        /*!< Bit 2 */

#define  TIM_SMCR_MSM                        ((uint32_t)0x00000080)        /*!< Master/slave mode */

#define  TIM_SMCR_ETF                        ((uint32_t)0x00000F00)        /*!< ETF[3:0] bits (External trigger filter) */
#define  TIM_SMCR_ETF_0                      ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  TIM_SMCR_ETF_1                      ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  TIM_SMCR_ETF_2                      ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  TIM_SMCR_ETF_3                      ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  TIM_SMCR_ETPS                       ((uint32_t)0x00003000)        /*!< ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_SMCR_ETPS_0                     ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  TIM_SMCR_ETPS_1                     ((uint32_t)0x00002000)        /*!< Bit 1 */

#define  TIM_SMCR_ECE                        ((uint32_t)0x00004000)        /*!< External clock enable */
#define  TIM_SMCR_ETP                        ((uint32_t)0x00008000)        /*!< External trigger polarity */

/*******************  Bit definition for TIM_EGR register  ********************/
#define  TIM_EGR_UG                          ((uint32_t)0x000001)          /*!< Update Generation */
#define  TIM_EGR_CC1G                        ((uint32_t)0x000002)          /*!< Capture/Compare 1 Generation */
#define  TIM_EGR_CC2G                        ((uint32_t)0x000004)          /*!< Capture/Compare 2 Generation */
#define  TIM_EGR_CC3G                        ((uint32_t)0x000008)          /*!< Capture/Compare 3 Generation */
#define  TIM_EGR_CC4G                        ((uint32_t)0x000010)          /*!< Capture/Compare 4 Generation */
#define  TIM_EGR_COMG                        ((uint32_t)0x000020)          /*!< Capture/Compare Control Update Generation */
#define  TIM_EGR_TG                          ((uint32_t)0x000040)          /*!< Trigger Generation */
#define  TIM_EGR_BG                          ((uint32_t)0x000080)          /*!< Break Generation */

/******************  Bit definition for TIM_CCMR1 register  *******************/
#define  TIM_CCMR1_CC1S                      ((uint32_t)0x00000003)        /*!< CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define  TIM_CCMR1_CC1S_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  TIM_CCMR1_CC1S_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */

#define  TIM_CCMR1_OC1FE                     ((uint32_t)0x00000004)        /*!< Output Compare 1 Fast enable */
#define  TIM_CCMR1_OC1PE                     ((uint32_t)0x00000008)        /*!< Output Compare 1 Buffer enable */

#define  TIM_CCMR1_OC1M                      ((uint32_t)0x00000070)        /*!< OC1M[2:0] bits (Output Compare 1 Mode) */
#define  TIM_CCMR1_OC1M_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  TIM_CCMR1_OC1M_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  TIM_CCMR1_OC1M_2                    ((uint32_t)0x00000040)        /*!< Bit 2 */

#define  TIM_CCMR1_CC2S                      ((uint32_t)0x00000300)        /*!< CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define  TIM_CCMR1_CC2S_0                    ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  TIM_CCMR1_CC2S_1                    ((uint32_t)0x00000200)        /*!< Bit 1 */

#define  TIM_CCMR1_OC2FE                     ((uint32_t)0x00000400)        /*!< Output Compare 2 Fast enable */
#define  TIM_CCMR1_OC2PE                     ((uint32_t)0x00000800)        /*!< Output Compare 2 Buffer enable */

#define  TIM_CCMR1_OC2M                      ((uint32_t)0x00007000)        /*!< OC2M[2:0] bits (Output Compare 2 Mode) */
#define  TIM_CCMR1_OC2M_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  TIM_CCMR1_OC2M_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  TIM_CCMR1_OC2M_2                    ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  TIM_CCMR1_IC1PSC                    ((uint32_t)0x0000000C)        /*!< IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define  TIM_CCMR1_IC1PSC_0                  ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  TIM_CCMR1_IC1PSC_1                  ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  TIM_CCMR1_IC1F                      ((uint32_t)0x000000F0)        /*!< IC1F[3:0] bits (Input Capture 1 Filter) */
#define  TIM_CCMR1_IC1F_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  TIM_CCMR1_IC1F_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  TIM_CCMR1_IC1F_2                    ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  TIM_CCMR1_IC1F_3                    ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  TIM_CCMR1_IC2PSC                    ((uint32_t)0x00000C00)        /*!< IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define  TIM_CCMR1_IC2PSC_0                  ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  TIM_CCMR1_IC2PSC_1                  ((uint32_t)0x00000800)        /*!< Bit 1 */

#define  TIM_CCMR1_IC2F                      ((uint32_t)0x0000F000)        /*!< IC2F[3:0] bits (Input Capture 2 Filter) */
#define  TIM_CCMR1_IC2F_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  TIM_CCMR1_IC2F_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  TIM_CCMR1_IC2F_2                    ((uint32_t)0x00004000)        /*!< Bit 2 */
#define  TIM_CCMR1_IC2F_3                    ((uint32_t)0x00008000)        /*!< Bit 3 */

/******************  Bit definition for TIM_CCMR2 register  *******************/
#define  TIM_CCMR2_CC3S                      ((uint32_t)0x00000003)        /*!< CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define  TIM_CCMR2_CC3S_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  TIM_CCMR2_CC3S_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */

#define  TIM_CCMR2_OC3FE                     ((uint32_t)0x00000004)        /*!< Output Compare 3 Fast enable */
#define  TIM_CCMR2_OC3PE                     ((uint32_t)0x00000008)        /*!< Output Compare 3 Buffer enable */

