jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
#define  TIM_CCMR2_OC3M                      ((uint32_t)0x00000070)        /*!< OC3M[2:0] bits (Output Compare 3 Mode) */
#define  TIM_CCMR2_OC3M_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  TIM_CCMR2_OC3M_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  TIM_CCMR2_OC3M_2                    ((uint32_t)0x00000040)        /*!< Bit 2 */

#define  TIM_CCMR2_CC4S                      ((uint32_t)0x00000300)        /*!< CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define  TIM_CCMR2_CC4S_0                    ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  TIM_CCMR2_CC4S_1                    ((uint32_t)0x00000200)        /*!< Bit 1 */

#define  TIM_CCMR2_OC4FE                     ((uint32_t)0x00000400)        /*!< Output Compare 4 Fast enable */
#define  TIM_CCMR2_OC4PE                     ((uint32_t)0x00000800)        /*!< Output Compare 4 Buffer enable */

#define  TIM_CCMR2_OC4M                      ((uint32_t)0x00007000)        /*!< OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TIM_CCMR2_OC4M_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  TIM_CCMR2_OC4M_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  TIM_CCMR2_OC4M_2                    ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  TIM_CCMR2_IC3PSC                    ((uint32_t)0x0000000C)        /*!< IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TIM_CCMR2_IC3PSC_0                  ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  TIM_CCMR2_IC3PSC_1                  ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  TIM_CCMR2_IC3F                      ((uint32_t)0x000000F0)        /*!< IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TIM_CCMR2_IC3F_0                    ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  TIM_CCMR2_IC3F_1                    ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  TIM_CCMR2_IC3F_2                    ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  TIM_CCMR2_IC3F_3                    ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  TIM_CCMR2_IC4PSC                    ((uint32_t)0x00000C00)        /*!< IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TIM_CCMR2_IC4PSC_0                  ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  TIM_CCMR2_IC4PSC_1                  ((uint32_t)0x00000800)        /*!< Bit 1 */

#define  TIM_CCMR2_IC4F                      ((uint32_t)0x0000F000)        /*!< IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TIM_CCMR2_IC4F_0                    ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  TIM_CCMR2_IC4F_1                    ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  TIM_CCMR2_IC4F_2                    ((uint32_t)0x00004000)        /*!< Bit 2 */
#define  TIM_CCMR2_IC4F_3                    ((uint32_t)0x00008000)        /*!< Bit 3 */

/*******************  Bit definition for TIM_CCER register  *******************/
#define  TIM_CCER_CC1E                       ((uint32_t)0x00000001)        /*!< Capture/Compare 1 output enable */
#define  TIM_CCER_CC1P                       ((uint32_t)0x00000002)        /*!< Capture/Compare 1 output Polarity */
#define  TIM_CCER_CC2E                       ((uint32_t)0x00000010)        /*!< Capture/Compare 2 output enable */
#define  TIM_CCER_CC2P                       ((uint32_t)0x00000020)        /*!< Capture/Compare 2 output Polarity */
#define  TIM_CCER_CC3E                       ((uint32_t)0x00000100)        /*!< Capture/Compare 3 output enable */
#define  TIM_CCER_CC3P                       ((uint32_t)0x00000200)        /*!< Capture/Compare 3 output Polarity */
#define  TIM_CCER_CC4E                       ((uint32_t)0x00001000)        /*!< Capture/Compare 4 output enable */
#define  TIM_CCER_CC4P                       ((uint32_t)0x00002000)        /*!< Capture/Compare 4 output Polarity */

/*******************  Bit definition for TIM_CNT register  ********************/
#define  TIM_CNT_CNT                         ((uint32_t)0x0000FFFF)        /*!< Counter Value */

/*******************  Bit definition for TIM_PSC register  ********************/
#define  TIM_PSC_PSC                         ((uint32_t)0x0000000F)        /*!< Prescaler Value */

/*******************  Bit definition for TIM_ARR register  ********************/
#define  TIM_ARR_ARR                         ((uint32_t)0x0000FFFF)        /*!< actual auto-reload Value */

/*******************  Bit definition for TIM_RCR register  ********************/
#define  TIM_RCR_REP                         ((uint32_t)0x0000FF)          /*!< Repetition Counter Value */

/*******************  Bit definition for TIM_CCR1 register  *******************/
#define  TIM_CCR1_CCR1                       ((uint32_t)0x0000FFFF)        /*!< Capture/Compare 1 Value */

/*******************  Bit definition for TIM_CCR2 register  *******************/
#define  TIM_CCR2_CCR2                       ((uint32_t)0x0000FFFF)        /*!< Capture/Compare 2 Value */

/*******************  Bit definition for TIM_CCR3 register  *******************/
#define  TIM_CCR3_CCR3                       ((uint32_t)0x0000FFFF)        /*!< Capture/Compare 3 Value */
                                                                           
/*******************  Bit definition for TIM_CCR4 register  *******************/
#define  TIM_CCR4_CCR4                       ((uint32_t)0x0000FFFF)        /*!< Capture/Compare 4 Value */

/*******************  Bit definition for TIM1_OR register   *******************/
#define TIM1_OR_EXTRIGSEL                    ((uint32_t)0x00000003)        /*!< Selects the external trigger used in external clock mode 2 */
#define TIM1_OR_EXTRIGSEL_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define TIM1_OR_EXTRIGSEL_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */

#define TIM1_OR_CLKMSKEN                     ((uint32_t)0x00000004)        /*!< Enables TIM1MSK when TIM1CLK is selected as the external trigger */
#define TIM1_OR_ORRSVD                       ((uint32_t)0x00000008)        /*!< Reserved: this bit must always be set to 0 */

/*******************  Bit definition for TIM2_OR register   *******************/
#define TIM2_OR_EXTRIGSEL                    ((uint32_t)0x00000003)        /*!< Selects the external trigger used in external clock mode 2 */
#define TIM2_OR_EXTRIGSEL_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define TIM2_OR_EXTRIGSEL_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */

#define TIM2_OR_CLKMSKEN                     ((uint32_t)0x00000004)        /*!< Enables TIM2MSK when TIM2CLK is selected as the external trigger */
#define TIM2_OR_ORRSVD                       ((uint32_t)0x00000008)        /*!< Reserved: this bit must always be set to 0 */
#define TIM2_OR_REMAPC1                      ((uint32_t)0x00000010)        /*!< Selects the GPIO used for TIM2_CH1 */
#define TIM2_OR_REMAPC2                      ((uint32_t)0x00000020)        /*!< Selects the GPIO used for TIM2_CH2 */
#define TIM2_OR_REMAPC3                      ((uint32_t)0x00000040)        /*!< Selects the GPIO used for TIM2_CH3 */
#define TIM2_OR_REMAPC4                      ((uint32_t)0x00000080)        /*!< Selects the GPIO used for TIM2_CH4 */

/*******************  Bit definition for TIM_IER register        **************/
#define TIM_IER_UIE                         ((uint32_t)0x00000001)         /*!< Update interrupt enable */
#define TIM_IER_CC1IE                       ((uint32_t)0x00000002)         /*!< Capture or compare 1 interrupt enable */
#define TIM_IER_CC2IE                       ((uint32_t)0x00000004)         /*!< Capture or compare 2 interrupt enable */
#define TIM_IER_CC3IE                       ((uint32_t)0x00000008)         /*!< Capture or compare 3 interrupt enable */
#define TIM_IER_CC4IE                       ((uint32_t)0x00000010)         /*!< Capture or compare 4 interrupt enable */
#define TIM_IER_TIE                         ((uint32_t)0x00000040)         /*!< Trigger interrupt enable */
 
/*******************  Bit definition for TIM_ISR register        **************/
#define TIM_ISR_UIP                         ((uint32_t)0x00000001)         /*!< Update interrupt pending */
#define TIM_ISR_CC1IP                       ((uint32_t)0x00000002)         /*!< Capture or compare 1 interrupt pending */
#define TIM_ISR_CC2IP                       ((uint32_t)0x00000004)         /*!< Capture or compare 2 interrupt pending */
#define TIM_ISR_CC3IP                       ((uint32_t)0x00000008)         /*!< Capture or compare 3 interrupt pending */
#define TIM_ISR_CC4IP                       ((uint32_t)0x00000010)         /*!< Capture or compare 4 interrupt pending */
#define TIM_ISR_TIP                         ((uint32_t)0x00000040)         /*!< Trigger interrupt */

