jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
#define TIM_ISR_RSVD                        ((uint32_t)0x00001E00)         /*!< Reserved: May change during normal operation */
#define TIM_ISR_RSVD_0                      ((uint32_t)0x00001E00)         /*!< Bit 0 */
#define TIM_ISR_RSVD_1                      ((uint32_t)0x00001E00)         /*!< Bit 1 */
#define TIM_ISR_RSVD_3                      ((uint32_t)0x00001E00)         /*!< Bit 2 */

/*******************  Bit definition for TIM_IMR register        **************/
#define TIM_IMR_RSVD                        ((uint32_t)0x000000EF)         /*!< Reserved: May change during normal operation */
#define TIM_IMR_RSVD_0                      ((uint32_t)0x00000001)         /*!< Bit 0 */
#define TIM_IMR_RSVD_1                      ((uint32_t)0x00000002)         /*!< Bit 1 */
#define TIM_IMR_RSVD_2                      ((uint32_t)0x00000004)         /*!< Bit 2 */
#define TIM_IMR_RSVD_3                      ((uint32_t)0x00000008)         /*!< Bit 3 */
#define TIM_IMR_RSVD_4                      ((uint32_t)0x00000010)         /*!< Bit 4 */
#define TIM_IMR_RSVD_5                      ((uint32_t)0x00000020)         /*!< Bit 5 */
#define TIM_IMR_RSVD_6                      ((uint32_t)0x00000040)         /*!< Bit 6 */

#define TIM_IMR_CC1IM                       ((uint32_t)0x00000200)         /*!< Capture or compare 1 interrupt missed */
#define TIM_IMR_CC2IM                       ((uint32_t)0x00000400)         /*!< Capture or compare 2 interrupt missed */
#define TIM_IMR_CC3IM                       ((uint32_t)0x00000800)         /*!< Capture or compare 3 interrupt missed */
#define TIM_IMR_CC4IM                       ((uint32_t)0x00001000)         /*!< Capture or compare 4 interrupt missed */

/******************************************************************************/
/*                                                                            */
/*                               SystemTick                                   */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for SysTick_CTRL register  *****************/
#define  SysTick_CTRL_ENABLE                 ((uint32_t)0x00000001)        /*!< Counter enable */
#define  SysTick_CTRL_TICKINT                ((uint32_t)0x00000002)        /*!< Counting down to 0 pends the SysTick handler */
#define  SysTick_CTRL_CLKSOURCE              ((uint32_t)0x00000004)        /*!< Clock source */
#define  SysTick_CTRL_COUNTFLAG              ((uint32_t)0x00010000)        /*!< Count Flag */

/*****************  Bit definition for SysTick_LOAD register  *****************/
#define  SysTick_LOAD_RELOAD                 ((uint32_t)0x00FFFFFF)        /*!< Value to load into the SysTick Current Value Register when the counter reaches 0 */

/*****************  Bit definition for SysTick_VAL register  ******************/
#define  SysTick_VAL_CURRENT                 ((uint32_t)0x00FFFFFF)        /*!< Current value at the time the register is accessed */

/*****************  Bit definition for SysTick_CALIB register  ****************/
#define  SysTick_CALIB_TENMS                 ((uint32_t)0x00FFFFFF)        /*!< Reload value to use for 10ms timing */
#define  SysTick_CALIB_SKEW                  ((uint32_t)0x40000000)        /*!< Calibration value is not exactly 10 ms */
#define  SysTick_CALIB_NOREF                 ((uint32_t)0x80000000)        /*!< The reference clock is not provided */

/******************************************************************************/
/*                                                                            */
/*                  Nested Vectored Interrupt Controller                      */
/*                                                                            */
/******************************************************************************/

/*Bit definition for NVIC_ISER, NVIC_ICER, NVIC_ISPR, NVIC_ICPR and NVIC_IABR**/
#define  NVIC_IxxR_TIM1                      ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_IxxR_TIM2                      ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_IxxR_MGMT                      ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_IxxR_SLEEPTMR                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_IxxR_SC1                       ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_IxxR_SC2                       ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_IxxR_ADC                       ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_IxxR_IRQA                      ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_IxxR_IRQB                      ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_IxxR_IRQC                      ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_IxxR_IRQD                      ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_IxxR_DEBUG                     ((uint32_t)0x00010000)        /*!< bit 16 */

/******************  Bit definition for NVIC_ISER register  *******************/
#define  NVIC_ISER_TIM1                      ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ISER_TIM2                      ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ISER_MGMT                      ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ISER_SLEEPTMR                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ISER_SC1                       ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ISER_SC2                       ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ISER_ADC                       ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ISER_IRQA                      ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ISER_IRQB                      ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ISER_IRQC                      ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ISER_IRQD                      ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ISER_DEBUG                     ((uint32_t)0x00010000)        /*!< bit 16 */

