jarekkt/step2mach/sources/mach_firmware/project_crossworks/STM32/include/stm32w108xx.h
/******************  Bit definition for NVIC_ICER register  *******************/
#define  NVIC_ICER_TIM1                      ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ICER_TIM2                      ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ICER_MGMT                      ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ICER_SLEEPTMR                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ICER_SC1                       ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ICER_SC2                       ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ICER_ADC                       ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ICER_IRQA                      ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ICER_IRQB                      ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ICER_IRQC                      ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ICER_IRQD                      ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ICER_DEBUG                     ((uint32_t)0x00010000)        /*!< bit 16 */ 

/******************  Bit definition for NVIC_ISPR register  *******************/
#define  NVIC_ISPR_TIM1                      ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ISPR_TIM2                      ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ISPR_MGMT                      ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ISPR_SLEEPTMR                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ISPR_SC1                       ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ISPR_SC2                       ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ISPR_ADC                       ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ISPR_IRQA                      ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ISPR_IRQB                      ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ISPR_IRQC                      ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ISPR_IRQD                      ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ISPR_DEBUG                     ((uint32_t)0x00010000)        /*!< bit 16 */ 

/******************  Bit definition for NVIC_ICPR register  *******************/
#define  NVIC_ICPR_TIM1                      ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ICPR_TIM2                      ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ICPR_MGMT                      ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ICPR_SLEEPTMR                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ICPR_SC1                       ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ICPR_SC2                       ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ICPR_ADC                       ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ICPR_IRQA                      ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ICPR_IRQB                      ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ICPR_IRQC                      ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ICPR_IRQD                      ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ICPR_DEBUG                     ((uint32_t)0x00010000)        /*!< bit 16 */ 

/******************  Bit definition for NVIC_IABR register  *******************/
#define  NVIC_IABR_TIM1                      ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_IABR_TIM2                      ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_IABR_MGMT                      ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_IABR_SLEEPTMR                  ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_IABR_SC1                       ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_IABR_SC2                       ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_IABR_ADC                       ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_IABR_IRQA                      ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_IABR_IRQB                      ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_IABR_IRQC                      ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_IABR_IRQD                      ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_IABR_DEBUG                     ((uint32_t)0x00010000)        /*!< bit 16 */ 

/******************  Bit definition for NVIC_PRI0 register  *******************/
#define  NVIC_IPR0_PRI_0                     ((uint32_t)0x000000FF)        /*!< Priority of interrupt 0 */
#define  NVIC_IPR0_PRI_1                     ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 1 */
#define  NVIC_IPR0_PRI_2                     ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 2 */
#define  NVIC_IPR0_PRI_3                     ((uint32_t)0xFF000000)        /*!< Priority of interrupt 3 */

/******************  Bit definition for NVIC_PRI1 register  *******************/
#define  NVIC_IPR1_PRI_4                     ((uint32_t)0x000000FF)        /*!< Priority of interrupt 4 */
#define  NVIC_IPR1_PRI_5                     ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 5 */
#define  NVIC_IPR1_PRI_6                     ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 6 */
#define  NVIC_IPR1_PRI_7                     ((uint32_t)0xFF000000)        /*!< Priority of interrupt 7 */

/******************  Bit definition for NVIC_PRI2 register  *******************/
#define  NVIC_IPR2_PRI_8                     ((uint32_t)0x000000FF)        /*!< Priority of interrupt 8 */
#define  NVIC_IPR2_PRI_9                     ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 9 */
#define  NVIC_IPR2_PRI_10                    ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 10 */
#define  NVIC_IPR2_PRI_11                    ((uint32_t)0xFF000000)        /*!< Priority of interrupt 11 */

/******************  Bit definition for NVIC_PRI3 register  *******************/
#define  NVIC_IPR3_PRI_12                    ((uint32_t)0x000000FF)        /*!< Priority of interrupt 12 */
#define  NVIC_IPR3_PRI_13                    ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 13 */
#define  NVIC_IPR3_PRI_14                    ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 14 */
#define  NVIC_IPR3_PRI_15                    ((uint32_t)0xFF000000)        /*!< Priority of interrupt 15 */

/******************  Bit definition for NVIC_PRI4 register  *******************/
#define  NVIC_IPR4_PRI_16                    ((uint32_t)0x000000FF)        /*!< Priority of interrupt 16 */
#define  NVIC_IPR4_PRI_17                    ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 17 */
#define  NVIC_IPR4_PRI_18                    ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 18 */
#define  NVIC_IPR4_PRI_19                    ((uint32_t)0xFF000000)        /*!< Priority of interrupt 19 */

/******************  Bit definition for NVIC_PRI5 register  *******************/
#define  NVIC_IPR5_PRI_20                    ((uint32_t)0x000000FF)        /*!< Priority of interrupt 20 */
#define  NVIC_IPR5_PRI_21                    ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 21 */
#define  NVIC_IPR5_PRI_22                    ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 22 */
#define  NVIC_IPR5_PRI_23                    ((uint32_t)0xFF000000)        /*!< Priority of interrupt 23 */

/******************  Bit definition for NVIC_PRI6 register  *******************/
#define  NVIC_IPR6_PRI_24                    ((uint32_t)0x000000FF)        /*!< Priority of interrupt 24 */
#define  NVIC_IPR6_PRI_25                    ((uint32_t)0x0000FF00)        /*!< Priority of interrupt 25 */
#define  NVIC_IPR6_PRI_26                    ((uint32_t)0x00FF0000)        /*!< Priority of interrupt 26 */
#define  NVIC_IPR6_PRI_27                    ((uint32_t)0xFF000000)        /*!< Priority of interrupt 27 */

